[
  {
    "state": "Alabama",
    "stateId": "AL",
    "sourceUrl": "https://www.nga.org/governors/alabama/",
    "scrapedAt": "2025-12-27T20:13:06.575Z",
    "governor": {
      "name": "Kay Ivey",
      "party": "Republican",
      "terms": [
        "April 19, 2017 - January 13, 2019",
        "January 14, 2019 - January 16, 2023",
        "January 16, 2023 - Current"
      ],
      "born": "October 15, 1944",
      "birthState": "Alabama",
      "school": "University of Auburn",
      "spouse": null,
      "contact": {
        "address": "600 Dexter Avenue\nMontgomery, AL 36130",
        "phone": "334.242.7100"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.alabama.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.alabama.gov/"
        }
      ],
      "about": [
        "Growing up in the small town of Camden in Wilcox County, Alabama, and working on her father’s farm, Kay Ivey was taught the value of hard work and living within one’s means. Her parents instilled the Alabama values of faith, family and community.",
        "After graduating from Auburn University in 1967, Kay worked as a high school teacher and a bank officer. She served as Reading Clerk of the Alabama House of Representatives under Speaker Joseph C. McCorquodale and was Assistant Director of the Alabama Development Office, where she worked to spur job creation and economic development across the state.",
        "In 2002, Kay became the first Republican elected State Treasurer since Reconstruction, and she was re-elected in 2006. As Treasurer, Kay was committed to making the office more open, transparent, and efficient. Kay was elected Lieutenant Governor in 2010, becoming the first Republican woman to hold the office in Alabama’s history.",
        "She again made history on November 4, 2014, by becoming the first Republican Lieutenant Governor re-elected to the office.",
        "Governor Ivey has been honored to receive numerous awards for her service to the state of Alabama, including the 2015 ALFA Service to Agriculture Award; Newsmax’s 50 Most Influential Female Republicans in the country; the American Institute of Aeronautics and Astronautics (AIAA) 2016 Public Service Award; and 2017 Citizen of the Year, by River Region Living Magazine. In September 2019, the Alabama-Florida Council of the Boy Scouts of America distinguished Governor Ivey as a Golden Eagle for her ‘scout like service’ and being a trailblazer for women. In 2021, Governor Ivey was awarded the prestigious Army Aviation Order of St. Michael Knight Award. The American Village also presented the governor their highest honor, the Cornerstone of Liberty Award. Most recently, Governor Ivey was presented the inaugural Cognia STEM Champion Award and the Alabama Automotive Manufacturers Association Hall of Fame Award.",
        "On April 10, 2017, Governor Ivey was sworn in as the 54th Governor of the state of Alabama in the Old Senate Chamber in the Alabama State Capitol by Acting Chief Justice Lyn Stuart. Following a successful nineteen months in office, the people of Alabama made history again in November 2018 by electing Governor Ivey to a full term. She is the first Lieutenant Governor of Alabama elected to a full term after taking over as governor due to a vacancy in the Governor’s Office.",
        "On January 14, 2019, Governor Ivey was officially sworn in for her full term by Associate Justice Will Sellers. Governor Ivey’s first term brought conservative leadership with effective results to make this generation more productive and the next generation more prosperous.",
        "Governor Ivey was reelected to a second full term November 2022 in a landslide voting outcome, and she was sworn in January 16, 2023. Noting education, economic development, roads and bridges, broadband expansion, public safety and government reform as the top priorities of her second administration, Governor Ivey vowed to keep Alabama working, ensuring the state’s best days are yet to come.",
        "She is a member of the First Baptist Church of Montgomery, the Montgomery Rotary Club and the Board of Directors of the Montgomery YMCA. Governor Ivey is also the first Girls State alumnus to be elected to an Alabama Constitutional Office."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2018/01/Governor-Ivey-2019-Headshot-scaled.jpg",
      "photoLocalPath": "governors/al-kay-ivey.jpg"
    }
  },
  {
    "state": "Alaska",
    "stateId": "AK",
    "sourceUrl": "https://www.nga.org/governors/alaska/",
    "scrapedAt": "2025-12-27T20:13:07.814Z",
    "governor": {
      "name": "Mike Dunleavy",
      "party": "Republican",
      "terms": [
        "December 3, 2018 - December 5, 2022",
        "December 5, 2022 - Current"
      ],
      "born": "May 5, 1961",
      "birthState": "Pennsylvania",
      "school": "Misericordia University; University of Alaska Fairbanks",
      "spouse": "Rose Dunleavy",
      "contact": {
        "address": "Office of the Governor\nP.O. Box 110001\nJuneau, AK 99811-0001",
        "phone": "907-465-3500"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://gov.alaska.gov/"
        },
        {
          "label": "State Website",
          "url": "http://alaska.gov/"
        }
      ],
      "about": [
        "Governor Mike Dunleavy arrived in Alaska in 1983 as a young man looking for opportunity, and he found it. His first job was working in a logging camp in Southeast Alaska. Later on, Governor Dunleavy pursued his dream of becoming a teacher. He earned his teacher’s certificate, and then a Master of Education degree from the University of Alaska Fairbanks. He spent nearly two decades in northwest Arctic communities working as a teacher, principal, and superintendent.",
        "Governor Dunleavy and his family moved to Wasilla in 2004, where he owned an educational consulting firm and worked on several educational projects statewide. Dunleavy served on the Mat-Su Borough School Board, with two years as Board President, and then as a state senator for five years.",
        "Dunleavy was first elected Governor in 2018 and then again in 2022, making him the first Republican Governor in Alaska to win re-election since 1978. Three days before taking office in 2018, a massive 7.1 magnitude earthquake struck Southcentral Alaska, causing significant damage throughout the region. Eight months later, much of Alaska was on fire, with a total of 2.6 million acres burning that summer. Six months after that, on January 28, 2020, the first plane carrying 201 American evacuees from Wuhan China touched down at the Ted Stevens Airport in Anchorage. State of Alaska officials were given very little warning to prepare to conduct health screenings for a little-understood virus that had yet to be named.  It was an eventful first year in office for Governor Dunleavy and it did not slow down. But through it all, he has kept the health of the economy and jobs at the forefront of his Administration’s policy setting initiatives and has been a true champion for the Alaskan business community.",
        "Governor Dunleavy’s wife Rose is from the Kobuk River Valley community of Noorvik. Together, they have three children – Maggie, Catherine, and Ceil – who were raised in both rural and urban Alaska.",
        "The Dunleavy’s enjoy spending time together as a family, often in Alaska’s great outdoors. Hunting, fishing, snowmachining, and camping are all favorite activities.",
        "Governor Dunleavy is focused on moving Alaska forward and believes that our greatest years are yet to come if we work together to maximize our potential."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/Gov_Dunleavy_Sep2023_square-scaled.jpg",
      "photoLocalPath": "governors/ak-mike-dunleavy.jpg"
    }
  },
  {
    "state": "American Samoa",
    "stateId": "AS",
    "sourceUrl": "https://www.nga.org/governors/american-samoa/",
    "scrapedAt": "2025-12-27T20:13:09.113Z",
    "governor": {
      "name": "Pula’ali’i Nikolao Pula",
      "party": "Republican",
      "terms": [
        "January 3, 2025 - Current"
      ],
      "born": "December 31, 1955",
      "birthState": "American Samoa",
      "school": "Menlo College; Brigham Young University; George Mason University",
      "spouse": "Lois Phillips-Pula",
      "contact": {
        "address": "Office of the Governor\nPago Pago, AS 96799",
        "phone": "684-633-4116"
      },
      "links": [
        {
          "label": "Government Website",
          "url": "https://www.americansamoa.gov/"
        }
      ],
      "about": [
        "Pula’ali’i Nikolao Iuli Tuiteleleapaga Pula is the youngest son of twelve children of Nikolao Iuli Tuiteleleapaga Pula, Sr. from the village of Leone & Oloalilo Ta’afulisia Simanuali’i Afoa Lutu Molio’o from the villages of Utulei, Fagatogo, and Pago Pago.  His father was one of the pioneers of the public school system in American Samoa.   His mother was a strong woman of faith that valued honesty and hard work.  He is married to his wife Lois Phillips-Pula, Ph.D., a retired professor from the Georgetown University School of Nursing.",
        "Pula’ali’i attended Catholic schools in his primary years, and later graduated from Marist Brothers High School, Atu’u, American Samoa as the valedictorian in 1974. He continued his undergraduate studies at Menlo College in Atheron, California, and later continued at Brigham Young University at Provo, Utah. Upon his junior year at BYU Provo, he received his calling in 1978 to serve a mission in Upolu, Savaii, and Tutuila. He would later return to his studies at the George Mason University in Fairfax, Virginia. Upon completion of his mission, Pula worked a short stint at the American Samoa Fono Legislature in the Reference Bureau. In 1981, he relocated to the mainland Washington D.C. and worked for Hawaii Senator Daniel K. Inouye as a special assistant for a year and half. He later worked as a legislative assistant to Congressman Fofo I.F. Sunia of American Samoa, and was the staff director of the Subcommittee on Public Building and Grounds of the House Committee on Public Works and Transportation. While on Capitol Hill for eleven years, he held different positions for both the House of Representatives, and the US Senate; he also worked for Senate Sergeant-at-Arms. In 1993, he later joined the Department of Interior (DOI) Office of Insular Affairs (OIA) as the Policy Desk Officer for the Commonwealth of the Northern Marianas Islands (CNMI), and later he became the Policy Division Director.",
        "At OIA from 1999 to 2002, he was immersed in a pivotal role and served as Acting Director of OIA. In August 2002, under the President Bush Administration and despite the expectation of many, Pula Nikolao was appointed as the Director of OIA. The position, normally a political appointee, was pronounced by deputy assistant secretary of Interior David B. Cohen, that because of Pula’s ability to navigate the role, a bipartisan approach was implemented. Cohen further stated about the selection, “Nik has a great amount of credibility with Republicans and Democrats alike, both on Capitol Hill, and in this administration.” Nik would be the first Pacific Islander of Samoan ancestry to be the DOI’s Director of Insular Affairs. During his tenure, he also served as the Acting Assistant Secretary of the Insular Affairs from January-September 2009, and January-February and July 2014. He would serve as the Director of DOI-OIA for the next twenty years from 2002 to 2022 when he retired as a Career (Senior Executive Service) Director of the Office of Insular Affairs of the Department of the Interior."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/GOV_PULA_2025.jpg",
      "photoLocalPath": "governors/as-pula-ali-i-nikolao-pula.jpg"
    }
  },
  {
    "state": "Arizona",
    "stateId": "AZ",
    "sourceUrl": "https://www.nga.org/governors/arizona/",
    "scrapedAt": "2025-12-27T20:13:10.306Z",
    "governor": {
      "name": "Katie Hobbs",
      "party": "Democratic",
      "terms": [
        "January 2, 2023 - Current"
      ],
      "born": "December 28, 1969",
      "birthState": "Arizona",
      "school": "Northern Arizona University, Arizona State University",
      "spouse": null,
      "contact": {
        "address": "Office of the Governor\n1700 W. Washington St.\nPhoenix, AZ 85007",
        "phone": "602-542-4331"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://azgovernor.gov/"
        },
        {
          "label": "State Website",
          "url": "https://az.gov/"
        }
      ],
      "about": [
        "Born and raised in Arizona, Governor Hobbs has spent her life exemplifying hard work and public service. After putting herself through college at both NAU and ASU, she began her career as a social worker working with homeless youth and later helped run one of the largest domestic violence shelters in the country. After seeing her fellow Arizonans continue to struggle with little action from the government, Governor Hobbs decided to take matters into her own hands and run for office.",
        "After being elected to the Arizona House in 2010, Governor Hobbs went on to serve in the Arizona State Legislature for four terms, including two as Senate Minority Leader. After working across the aisle to deliver for Arizonans, Governor Hobbs saw an opportunity to use her leadership skills to serve Arizonans across the state. In 2018, she was elected Secretary of State, where she successfully oversaw a contentious election cycle and forcefully defended the votes and voices of every single Arizonan. Seeing her home state at a critical turning point, Governor Hobbs made the decision to run for Governor, and in 2022 was elected the fifth woman, and also fifth Arizona native, to lead the state.",
        "With over a decade of public service, Governor Hobbs sees her role in government as a continuation of her social work. In her first term, she has already moved the needle forward on some of our state’s most critical issues, including housing, water security, and economic development. Governor Hobbs approaches every situation and every challenge with a desire to make people’s lives better and give every Arizonan an opportunity to thrive."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/governor-katie-hobbs-scaled.jpeg",
      "photoLocalPath": "governors/az-katie-hobbs.jpeg"
    }
  },
  {
    "state": "Arkansas",
    "stateId": "AR",
    "sourceUrl": "https://www.nga.org/governors/arkansas/",
    "scrapedAt": "2025-12-27T20:13:12.080Z",
    "governor": {
      "name": "Sarah Huckabee Sanders",
      "party": "Republican",
      "terms": [
        "January 10, 2023 - Current"
      ],
      "born": "August 13, 1982",
      "birthState": "Arkansas",
      "school": "Ouachita Baptist University",
      "spouse": "Bryan Sanders",
      "contact": {
        "address": "500 Woodlane St.\nLittle Rock, AR 72201",
        "phone": "501-682-2345"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.arkansas.gov/"
        },
        {
          "label": "State Website",
          "url": "https://portal.arkansas.gov/"
        }
      ],
      "about": [
        "Sarah Huckabee Sanders is the 47th Governor of Arkansas.",
        "Inaugurated on January 10, 2023, she is the first woman to serve as governor of the state and currently is the youngest governor in the country.",
        "Since taking office, Sarah has enacted transformational, conservative reforms. Those include Arkansas LEARNS, a sweeping overhaul of Arkansas’ education system, including higher teacher pay and universal school choice; public safety reforms to invest in prison space and get repeat offenders off the streets; tax cuts to give more taxpayer money back to Arkansans; the Natural State Initiative to grow Arkansas’ outdoor economy; and reforms to streamline state government.",
        "In just her first 100 days, Sarah delivered the Republican response to President Joe Biden’s State of the Union Address, offering a bold vision for a new generation of conservative leadership.",
        "Prior to her historic victory, Sarah served as White House Press Secretary for President Donald J. Trump from 2017 to 2019. A trusted confidant of the President, she advised him on everything from press and communications strategy to personnel and policy. Sarah was only the third woman – and the very first mom – to ever hold the job of White House Press Secretary.",
        "Sarah joined the Trump campaign as a senior advisor in February 2016 during the Republican primary and continued in that role through the President’s historic victory that November.",
        "She has previously worked in leadership roles for U.S. Senators, Governors, and presidential campaigns. In Arkansas, Sarah was a senior advisor to U.S. Senator Tom Cotton’s 2014 victorious campaign and was campaign manager for U.S. Senator John Boozman’s winning campaign in 2010. In 2007 and 2008, Sarah helped lead her father, former Arkansas Governor Mike Huckabee, to victory in the Iowa Caucuses and seven other states as his national political director. Sarah also served in the Department of Education during President George W. Bush’s administration.",
        "She has been recognized in Fortune and TIME Magazine “40 under 40.” Sarah is the author of the New York Times bestseller “Speaking for Myself,” a former Fox News Channel contributor, and served on the Fulbright board.",
        "Sarah grew up in Pine Bluff and Texarkana and is a proud graduate of Little Rock Central High and Ouachita Baptist University.",
        "She lives in Little Rock with her husband, Bryan, their children Scarlett, Huck, and George, and their golden retriever, Traveler."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/Governor-Headshot-sanders-e1756131825437.jpg",
      "photoLocalPath": "governors/ar-sarah-huckabee-sanders.jpg"
    }
  },
  {
    "state": "California",
    "stateId": "CA",
    "sourceUrl": "https://www.nga.org/governors/california/",
    "scrapedAt": "2025-12-27T20:13:13.178Z",
    "governor": {
      "name": "Gavin Newsom",
      "party": "Democratic",
      "terms": [
        "January 7, 2019 - January 6, 2023",
        "January 6, 2023 - Current"
      ],
      "born": "October 10, 1967",
      "birthState": "California",
      "school": "Santa Clara University",
      "spouse": "Jennifer Siebel Newsom",
      "contact": {
        "address": "1021 O Street, Suite 9000\nSacramento, CA 95814",
        "phone": "916-445-2841"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.gov.ca.gov/"
        },
        {
          "label": "Governor's Bio",
          "url": "https://www.gov.ca.gov/about/"
        },
        {
          "label": "State Website",
          "url": "https://www.ca.gov/"
        }
      ],
      "about": [
        "Gavin Newsom is the Governor of California, former Lieutenant Governor of California, and former Mayor of San Francisco. Newsom is widely recognized for his willingness to lead – repeatedly developing, advocating, and implementing innovative and groundbreaking solutions to some of our most challenging issues.",
        "On a wide range of topics including same-sex marriage, gun safety, marijuana, the death penalty, universal health care, access to preschool, technology, criminal justice reform, and the minimum wage, Newsom stuck his neck out and did the right thing, which often led to sweeping changes when his policies were ultimately accepted, embraced, and replicated across the state and nation. Newsom’s top priorities for his administration include:",
        "Governor Newsom is married to Jennifer Siebel Newsom. They have four children: Montana, Hunter, Brooklynn, and Dutch."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/1200px-Gavin_Newsom_official_photo_square.jpg",
      "photoLocalPath": "governors/ca-gavin-newsom.jpg"
    }
  },
  {
    "state": "Colorado",
    "stateId": "CO",
    "sourceUrl": "https://www.nga.org/governors/colorado/",
    "scrapedAt": "2025-12-27T20:13:15.010Z",
    "governor": {
      "name": "Jared Polis",
      "party": "Democratic",
      "terms": [
        "January 8, 2019 - January 10, 2023",
        "January 10, 2023 - Current"
      ],
      "born": "May 12, 1975",
      "birthState": "Colorado",
      "school": "Princeton University",
      "spouse": "Marlon Reis",
      "contact": {
        "address": "State Capitol Bldg\n200 E. Colfax Ave., Rm. 136\nDenver, CO 80203",
        "phone": "303-866-2471"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.colorado.gov/governor/"
        },
        {
          "label": "State Website",
          "url": "https://www.colorado.gov/"
        }
      ],
      "about": [
        "Governor Jared Polis is an entrepreneur, education leader, and public servant. After launching several successful companies, including one out of his college dorm room, Polis committed himself to making sure other Coloradans had the opportunity to pursue their dreams. Polis founded schools for at-risk students and new immigrants and started nonprofits to help veterans and entrepreneurs.",
        "Prior to serving as Governor, Polis served on the State Board of Education where he worked to raise pay for teachers and reduce class size for students, and represented Colorado’s 2nd Congressional district, where he was rated the most effective member of the Colorado delegation.",
        "As Governor, Polis has focused on saving Coloradans money, keeping our economy strong, and preserving our Colorado way of life. Polis delivered universal free full-day kindergarten, signed a number of bills to save families money on health care, and made significant progress towards the goal of 100% renewable energy by 2040, all while cutting taxes for small businesses and investing in affordable housing and transportation. His efforts to expand health care access to medically underserved communities and to ensure that equity and justice remain central to building a Colorado for All have produced impactful legislation and made progress toward his administration’s bold vision."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/01/Colorado-Jared-Polis-November-2019.jpg",
      "photoLocalPath": "governors/co-jared-polis.jpg"
    }
  },
  {
    "state": "Connecticut",
    "stateId": "CT",
    "sourceUrl": "https://www.nga.org/governors/connecticut/",
    "scrapedAt": "2025-12-27T20:13:16.296Z",
    "governor": {
      "name": "Ned Lamont",
      "party": "Democratic",
      "terms": [
        "January 9, 2019 - January 4, 2023",
        "January 4, 2023 - Current"
      ],
      "born": "January 3, 1954",
      "birthState": "Washington, D.C.",
      "school": "Harvard University; Yale University",
      "spouse": "Annie Lamont",
      "contact": {
        "address": "Office of the Governor\nState Capitol\n210 Capitol Avenue\nHartford, CT 06106",
        "phone": "860-566-4840"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://portal.ct.gov/governor/"
        },
        {
          "label": "State Website",
          "url": "https://portal.ct.gov/"
        }
      ],
      "about": [
        "Ned Lamont was sworn into office as the 89th governor of Connecticut on January 9, 2019. He began his second term on January 4, 2023.",
        "Lamont got involved in public service shortly after college, founding a weekly newspaper in a town hit by the loss of its largest employer. Covering town meetings and the Board of Selectmen, he helped to bring voice and transparency to a community working to recover from job losses and reinvent itself. Later, as a member of both the Greenwich Board of Selectmen and the Board of Estimate and Taxation, Lamont worked in a bipartisan effort to safeguard a multimillion-dollar budget and deliver results for constituents. For four years, Lamont also served as Chairman of the State Investment Advisory Council, overseeing a multibillion-dollar state pension fund.",
        "Lamont started his own company, taking on the large and established giants of the telecom industry. Under his vision and stewardship, the company grew to serve over 400 of America’s largest college campuses and 1 million college students across the nation.",
        "As a volunteer teacher, Lamont sought to give back to his community by volunteering at Harding High School in Bridgeport. In an effort to spark entrepreneurship, Lamont taught students about the inner-workings of small businesses, bringing in local businesspeople to share their own experiences, and helping to place students in local internships. Lamont is on the faculty of Central Connecticut State University as an adjunct professor of political science and philosophy, where he also helped to found a popular business start-up competition. In early 2009, he helped lead an initiative to bring together Connecticut leaders from across the business, nonprofit, and labor sectors to unite in a strategy to create new jobs in the state.",
        "As a candidate for United States Senate in 2006, he stood up for his convictions and challenged the political establishment. Taking on long-time incumbent Joe Lieberman for the Democratic nomination for United States Senate, Lamont campaigned on the platform that wars in the Middle East were draining resources and attention that could be better focused on pressing domestic issues like the economy, education, and healthcare. As a private citizen, he fought for the issues in which he believes, serving on the boards of Mercy Corps and the Conservation Services Group, non-profits which seek to make a difference in the humanitarian and renewable energy fields, respectively.",
        "Lamont was born on January 3, 1954, in Washington, D.C. to Camille Helene and Edward Miner Lamont. The eldest of three children, he attended Phillips Exeter Academy, and served as president of the student newspaper, The Exonian. After graduating Phillips Exeter in 1972, he earned a Bachelor of Arts in sociology from Harvard College in 1976 and a Master of Business Administration from the Yale School of Management in 1980.",
        "Lamont married his wife Annie on September 10, 1983. They have three children: Emily, Lindsay, and Teddy."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/govlamont-scaled.jpg",
      "photoLocalPath": "governors/ct-ned-lamont.jpg"
    }
  },
  {
    "state": "Delaware",
    "stateId": "DE",
    "sourceUrl": "https://www.nga.org/governors/delaware/",
    "scrapedAt": "2025-12-27T20:13:17.732Z",
    "governor": {
      "name": "Matt Meyer",
      "party": "Democratic",
      "terms": [
        "January 21, 2025 - Current"
      ],
      "born": "September 21, 1971",
      "birthState": "Michigan",
      "school": "Brown University (BA); University of Michigan (JD)",
      "spouse": null,
      "contact": {
        "address": "150 Martin Luther King Jr Blvd\nSouth Dover, DE 19901",
        "phone": "302-744-4101"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.delaware.gov/"
        },
        {
          "label": "State Website",
          "url": "https://delaware.gov/"
        }
      ],
      "about": [
        "Governor Matthew S. Meyer is a former public school math teacher and small business owner who served as New Castle County Executive from 2017 through January 2025. As the leader of Delaware’s largest local government, Matt proved that government can still work for the people–delivering real results for real people and making real progress for Delaware’s working families.",
        "Growing up in Delaware, Matt attended schools in the Brandywine School District, followed by Wilmington Friends School, and then studied Computer Science & Political Science at Brown University. He then moved to Nairobi, Kenya, where he learned Swahili and created Ecosandals, a recycled footwear company that sold environmentally friendly footwear to customers in 17 countries on five continents. Matt subsequently spent 12 months in Mosul, Iraq, as a diplomat embedded with the United States Army during Operation Iraqi Freedom and Operation New Dawn.",
        "Afterward, Matt returned to Delaware and worked as a middle school math teacher in a public school in one of Wilmington’s most underserved communities. There, he taught sixth and seventh-grade students, many of whom were living in unstable housing and experiencing the devastating impact of gun violence in their neighborhoods. Matt saw first-hand that homework and linear equations were the last thing on his students’ minds when they didn’t know where they were sleeping that night or where their next meal was coming from. Matt ran for office for the first time in 2016, defeating a three-term incumbent by challenging party leaders and powerful special interests and knocking on ten thousand doors.",
        "Matt lives in Wilmington with his wife, Dr. Lauren Meyer. Lauren is an emergency room physician who has worked in hospitals in New Castle, Kent, and Sussex counties. Just this year, Lauren and Matt had their first child together, Levi, who loves storytime and hates car seats."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/matt-meyer_800x600.jpg",
      "photoLocalPath": "governors/de-matt-meyer.jpg"
    }
  },
  {
    "state": "Florida",
    "stateId": "FL",
    "sourceUrl": "https://www.nga.org/governors/florida/",
    "scrapedAt": "2025-12-27T20:13:19.024Z",
    "governor": {
      "name": "Ron DeSantis",
      "party": "Republican",
      "terms": [
        "January 8, 2019 - January 3, 2023",
        "January 3, 2023 - Current"
      ],
      "born": "September 14, 1978",
      "birthState": "Florida",
      "school": "Yale University, Harvard Law School",
      "spouse": "Casey DeSantis",
      "contact": {
        "address": "400 S Monroe St.\nTallahassee, FL 32399",
        "phone": "850-488-7146"
      },
      "links": [
        {
          "label": "Governer's Website",
          "url": "https://www.flgov.com/"
        },
        {
          "label": "Governer's Bio",
          "url": "https://www.flgov.com/eog/leadership/people/ron-desantis"
        },
        {
          "label": "State Website",
          "url": "http://www.myflorida.com/"
        }
      ],
      "about": [
        "A native Floridian with blue-collar roots, Governor DeSantis grew up in Dunedin and worked his way through Yale University, where he was the captain of the varsity baseball team, and graduated with honors from Harvard Law School, where he earned a commission in the U.S. Navy as a JAG officer. He deployed to Iraq in support of the SEAL mission in Fallujah, Ramadi, and the rest of the Al Anbar province.",
        "In 2018, Ron DeSantis was elected the 46th Governor of Florida. As Governor, he has led across a wide range of issues by successfully navigating Florida through the COVID pandemic, protecting Floridians from the harmful impacts of illegal immigration, expanding school choice, promoting public safety (with a record 50-year crime low in the state), keeping Florida’s economy strong, ensuring road improvement projects are fully funded and ahead of schedule, and making historic investments in environmental conservation and stewardship.",
        "Thanks to the Governor’s efforts, Florida ranks #1 for economy (among all 50 states); for education (two years in a row); for higher education (eight years in a row); for attracting and developing a talented workforce; for parental empowerment and educational freedom; for tourism and net in-migration; and for law enforcement recruiting and support.",
        "Governor DeSantis is married to Casey DeSantis, an Emmy Award-winning television anchor. Together, they’re the proud parents of their daughters, Madison and Mamie, and their son, Mason."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/Ron_DeSantis_Official_Portrait_113th_Congress.jpg",
      "photoLocalPath": "governors/fl-ron-desantis.jpg"
    }
  },
  {
    "state": "Georgia",
    "stateId": "GA",
    "sourceUrl": "https://www.nga.org/governors/georgia/",
    "scrapedAt": "2025-12-27T20:13:20.141Z",
    "governor": {
      "name": "Brian Kemp",
      "party": "Republican",
      "terms": [
        "January 14, 2019 - January 9, 2023",
        "January 9, 2023 - Current"
      ],
      "born": "November 2, 1963",
      "birthState": "Georgia",
      "school": "University of Georgia",
      "spouse": "Marty Kemp",
      "contact": {
        "address": "206 Washington Street Suite 203\nState Capitol\nAtlanta, GA 30334",
        "phone": "404-656-1776"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://gov.georgia.gov/"
        },
        {
          "label": "Governor's Bio",
          "url": "https://gov.georgia.gov/profiles/brian-p-kemp"
        },
        {
          "label": "State Website",
          "url": "https://georgia.gov/"
        }
      ],
      "about": [
        "A native of Athens, Georgia, Brian Kemp started his first small business over 35 years ago with a pickup truck and a shovel. His experience as a small business owner has driven his mission to put hardworking Georgians first since taking office as Georgia’s 83rd governor in 2019.",
        "Throughout his first term, the Peach State consistently broke economic records, with jobs and investments coming to every region of the state. Thanks to his decision to reopen Georgia’s economy during the COVID-19 pandemic – the first state in the nation to do so – its unemployment rate remains at historic lows, there are more Georgians working than ever before, and the state has been named No. 1 for business for an unprecedented ten consecutive years.",
        "In 2022, Governor Kemp was re-elected to serve a second term, running on a record of economic success in the Peach State and a plan to help Georgia families fight through 40-year-high inflation while strengthening public safety and improving education. He has championed legislation to crack down on violent crimes and street gangs, end human trafficking and support its victims, enact historic tax cuts for families, give teachers historic pay raises, and ensure Georgia’s K-12 education system puts students and parents first.",
        "Governor Kemp, First Lady Marty Kemp, and their three adult daughters live on their family farm in Athens."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/GovBrianKemp_2024WEB.jpg",
      "photoLocalPath": "governors/ga-brian-kemp.jpg"
    }
  },
  {
    "state": "Guam",
    "stateId": "GU",
    "sourceUrl": "https://www.nga.org/governors/guam/",
    "scrapedAt": "2025-12-27T20:13:22.007Z",
    "governor": {
      "name": "Lou Leon Guerrero",
      "party": "Democratic",
      "terms": [
        "January 7, 2019 - January 2, 2023",
        "January 2, 2023 - Current"
      ],
      "born": "November 8, 1950",
      "birthState": "Guam",
      "school": "California State University, University of California, Los Angeles",
      "spouse": "Jeff Cook",
      "contact": {
        "address": "Ricardo J Bordallo Governor’s Complex\n513 West Marine Corps Drive\nHagatna, GU 96910",
        "phone": "671-472-8931"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.guam.gov/"
        },
        {
          "label": "Territory Website",
          "url": "http://www.guam.gov/"
        }
      ],
      "about": [
        "The Honorable Lourdes “Lou” Aflague Leon Guerrero is the ninth Governor of Guam and the first female governor of the territory. She is also a registered nurse, a businesswoman, a policymaker, a mother, and a grandmother.",
        "Since taking office in January 2019, she eliminated GovGuam’s $83 million general fund deficit, paid tax refunds the fastest in Guam’s history, raised salaries for nurses, law enforcement officers, and teachers, and ended two costly federal receiverships. Within her first year in office, she worked with the Guam Legislature to raise the minimum wage, legalize cannabis, and deliver millions in long-overdue war reparations to Guam’s World War II survivors.",
        "Within months of the unprecedented global pandemic, Governor Leon Guerrero created the island’s first-ever unemployment program, providing $808 million to over 30,000 displaced workers. This is in addition to over $100 million in direct aid distributed to over 2,500 local businesses and multiple innovative programs to aid Guam families in recovery. Under her leadership, Guam also achieved one of the highest vaccination rates in the nation. She continues to champion healthcare initiatives, including establishing the island’s first-ever paramedic program, and she is currently on a mission to rebuild Guam’s only decades-old public hospital.",
        "A graduate of the Academy of Our Lady of Guam (AOLG), Governor Leon Guerrero embarked on a career in nursing, earning a Bachelor of Science in Nursing from California State University and later a Master of Public Health from UCLA. She has worked as a staff nurse in hospitals in both California and Guam. Governor Leon Guerrero has also held several management positions in health care at the Guam Memorial Hospital and FHP Inc. and served on the GMHA Board of Trustees. To this day, Governor Leon Guerrero continues to be passionate about health care and has maintained her licensure as a registered nurse.",
        "In 1994, the people of Guam elected Governor Leon Guerrero to the first of five terms in the Guam Legislature. As a Senator, Governor Leon Guerrero served as Majority Leader and Chair of the Committee on Rules and the Committee on Health. Among her achievements are laws creating the Healthy Futures Fund and banning smoking in restaurants and bars.",
        "In 2005, with the passing of her brother Tony, Governor Leon Guerrero assumed the helm at the Bank of Guam as its new CEO and President. Under her leadership, the Bank of Guam doubled its assets to become a $2 billion enterprise.",
        "Governor Leon Guerrero has also served on the boards of many civic organizations. She is a founding member, past board member, and past President of the Guam Women’s Chamber of Commerce. Her many awards and honors include Guam Business Magazine’s 2010 Executive of the Year, SBA –Women in Business Champion, AOLG Hall of Fame, and American Nurses Association Excellence in Nursing.",
        "Governor Leon Guerrero is one of three children born to the late Jesus S. Leon Guerrero and Eugenia A. Leon Guerrero. She is married to Attorney Jeff Cook, and they have two children and eight grandchildren."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/GUAM-LOURDES-LEON-GUERRERO_square-scaled.jpg",
      "photoLocalPath": "governors/gu-lou-leon-guerrero.jpg"
    }
  },
  {
    "state": "Hawaii",
    "stateId": "HI",
    "sourceUrl": "https://www.nga.org/governors/hawaii/",
    "scrapedAt": "2025-12-27T20:13:23.409Z",
    "governor": {
      "name": "Josh Green",
      "party": "Democratic",
      "terms": [
        "December 5, 2022 - Current"
      ],
      "born": "February 11, 1970",
      "birthState": "Pennsylvania",
      "school": "Swarthmore College, Pennsylvania State University and the University of Pittsburgh",
      "spouse": "Jaime Kanani Green",
      "contact": {
        "address": "Executive Chambers\nState Capitol\n415 South Beretania St.\nHonolulu, Hawai‘i 96813",
        "phone": "808-586-0034"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.hawaii.gov/"
        },
        {
          "label": "State Website",
          "url": "https://portal.ehawaii.gov/"
        }
      ],
      "about": [
        "Governor Josh Green is a proud husband, father, physician, and Hawaiʻiʻs ninth governor. Raised in Pittsburgh, Pennsylvania, Governor Green received his degree in both biology and anthropology from Swarthmore College and his M.D. from Penn State Milton S. Hershey Medical Center at Pennsylvania State University. After graduating medical school he completed his residency in Family Practice. He was then awarded a National Health Service Corps scholarship and chose a position to practice medicine in the underserved area of Kā’ū on the Big Island of Hawai’i.",
        "From an early age, Governor Green understood the life changing effects that access to quality healthcare and medicine can have on the trajectory of a person’s life. As a doctor, he became part of the community he served.  He saw the difficulties and challenges local families faced, especially in rural areas: the high cost of living, the lack of affordable housing, the high rates of mental illness and addiction, and access to healthcare.",
        "After learning about their struggles and hearing directly from the people about the need for change, he ran for office. He served in the Hawaiʻi State House of Representatives from 2004 to 2008. From 2008 to 2018, he served in the Hawaiʻi State Senate, including as Majority Floor Leader, Chair of the Health and Human Services committees, and Vice Chair of the Energy and Environment, and Human Services and Housing committees. Governor Green was recognized for his leadership in healthcare, providing health insurance for every child in the state of Hawaii, and passing “Lukeʻs Law,” which provides insurance coverage for kids with autism. He also helped spearhead the creation of the Cancer Research Center, passed groundbreaking anti-tobacco legislation, which increased the legal age for purchasing tobacco and e-cigarettes to 21, and created a statewide trauma healthcare system.",
        "In 2018, he was elected to be the Lieutenant Governor of Hawaiʻi. As Lieutenant Governor, he saw the need for real solutions on homelessness and helped build “kauhale” communities and the H4 clinic to provide housing and healthcare for those most in need. In 2019 when the measles epidemic hit, he led a team of more than 75 doctors, nurses, and other medical professionals on an emergency mission to the Independent State of Samoa. His team successfully vaccinated 37,000 people. Just a few months later when the COVID pandemic spread to Hawai‘i, Governor Green was appointed as the COVID liaison between the state and healthcare communities to coordinate pandemic preparedness, response, and mitigation efforts. As a result of his leadership, these critical emergency efforts resulted in Hawaiʻi having the nation’s lowest COVID-19 fatality rate.",
        "Throughout his legislative career, Governor Green practiced emergency room medicine in the rural areas of the Big Island.  He has twice been named Physician of the Year by the Hawai‘i Medical Association, most recently in 2022 for his leadership and service during the COVID-19 pandemic.",
        "Governor Green is married to Jaime Kanani Green and they have two children, Maia and Sam.  Like many local families, they enjoy playing games together, going on family walks, and shopping at farmers markets. Governor Green remains an avid fan of his hometown football team, the Pittsburgh Steelers.",
        "Governor Green is inspired by the hopes, challenges and values of Hawai‘i’s families that encourage him to do his part for the people of our islands — and he is honored to serve as Governor."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2022/12/Governor_Josh_Green.jpg",
      "photoLocalPath": "governors/hi-josh-green.jpg"
    }
  },
  {
    "state": "Idaho",
    "stateId": "ID",
    "sourceUrl": "https://www.nga.org/governors/idaho/",
    "scrapedAt": "2025-12-27T20:13:24.940Z",
    "governor": {
      "name": "Brad Little",
      "party": "Republican",
      "terms": [
        "January 7, 2019 - January 6, 2023",
        "January 6, 2023 - Current"
      ],
      "born": "February 15, 1954",
      "birthState": "Idaho",
      "school": "University of Idaho",
      "spouse": "Teresa Little",
      "contact": {
        "address": "State Capitol\nPO Box 83720\nBoise, ID 83720",
        "phone": "208-334-2100"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://gov.idaho.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.state.id.us/"
        }
      ],
      "about": [
        "Brad Little is Idaho’s 33rd Governor, leading the people of Idaho through the most prosperous time in state history. His tenure as Governor is marked by unprecedented red tape reduction, record tax relief, and historic investments in education, workforce training, and infrastructure.",
        "The people of Idaho elected Brad Little to be their Governor in November of 2018 and reelected him in November of 2022. He has served as Idaho’s 33rd Governor since January 7, 2019.",
        "Governor Little is an Emmett native who was raised on his family’s sheep and cattle ranching operation. He graduated from the University of Idaho in 1977 with a Bachelor of Science in Agribusiness and has worked in the ranching industry for his entire professional life. He also has extensive experience in the Idaho banking and manufacturing industries.",
        "In 1978, Brad Little had good fortune and married Teresa Soulen of Weiser. Teresa and Brad are the proud parents of two sons who have wonderful wives – Adam and Angela, and David and Kelsey. They have six beautiful grandchildren.",
        "For more than three decades, Governor Little has taken on leadership roles within the state to promote better opportunities for the Idaho people. He was selected for leadership positions by his peers in agriculture, including public lands resource management resolutions for grazing and timber resources. He also was selected for leadership roles in organizations that cut across Idaho business, education, and philanthropy.",
        "Governor Little has a heart for public service. He first served in public office in 2001 when he was selected to fill a Senate vacancy. He was then elected to four consecutive terms to the Idaho Senate. During his service as a Senator, Brad was elected by his Republican peers during his first full term to serve in Party leadership as Majority Caucus Chair. He then served as Idaho’s 37th Lt. Governor starting on January 6, 2009.",
        "Governor Little is committed to making decisions through one lens: the lens of ensuring Idaho’s children and grandchildren have the best opportunities to stay in Idaho and for the ones who have left to choose to return."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/governor_little_square.jpg",
      "photoLocalPath": "governors/id-brad-little.jpg"
    }
  },
  {
    "state": "Illinois",
    "stateId": "IL",
    "sourceUrl": "https://www.nga.org/governors/illinois/",
    "scrapedAt": "2025-12-27T20:13:26.163Z",
    "governor": {
      "name": "JB Pritzker",
      "party": "Democratic",
      "terms": [
        "January 14, 2019 - January 9, 2023",
        "January 9, 2023 - Current"
      ],
      "born": "January 19, 1965",
      "birthState": "California",
      "school": "Duke University; Northwestern University School of Law",
      "spouse": "MK Pritzker",
      "contact": {
        "address": "Office of the Governor\n401 S. Spring St.\nSpringfield, IL 62704",
        "phone": "217-782-6830"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www2.illinois.gov/sites/gov/Pages/default.aspx"
        },
        {
          "label": "State Website",
          "url": "https://www2.illinois.gov/"
        }
      ],
      "about": [
        "Governor JB Pritzker is Illinois’ 43rd Governor, elected in 2018 and reelected in 2022 with the highest vote share for any Democratic governor in more than 60 years. Since taking office, he has accomplished one of the most ambitious policy agendas in the nation.",
        "During his tenure, he has worked with the General Assembly to overcome years of fiscal mismanagement by balancing the state budget every year, eliminating the state’s multi-billion-dollar bill backlog, improving pension funding, and achieving nine credit rating upgrades.",
        "He raised the minimum wage to a living wage and made historic investments to infrastructure.",
        "He has attracted massive new investments in electric vehicle manufacturing and quantum computing, helping Illinois’ economy reach over a trillion dollars. Illinois now ranks among the top five states for infrastructure and workforce development and has significantly improved its ranking among CNBC’s “Best States for Business.”",
        "Illinois is now a top five state for college readiness and its high school graduation rate is at its highest level in more than a dozen years. University of Illinois has become a top ten public university in the U.S., and community college tuition is now free for working-class families.",
        "Governor Pritzker led nation-leading climate action and clean energy expansion, creating thousands of new jobs and doubling the state’s renewable energy production.",
        "With a focus on families and children, his leadership has led to an assault weapons ban, nation-leading reproductive rights protections, a ban on book bans, and guaranteed paid leave for every worker in the state.",
        "Governor Pritzker and his wife, MK, have been married for more than 30 years, and they are the proud parents of two children."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/governor-pritzker-headshot_feb2023.jpg",
      "photoLocalPath": "governors/il-jb-pritzker.jpg"
    }
  },
  {
    "state": "Indiana",
    "stateId": "IN",
    "sourceUrl": "https://www.nga.org/governors/indiana/",
    "scrapedAt": "2025-12-27T20:13:27.368Z",
    "governor": {
      "name": "Mike Braun",
      "party": "Republican",
      "terms": [
        "January 13, 2025 - Current"
      ],
      "born": "March 24, 1954",
      "birthState": "Indiana",
      "school": "Wabash College (BA); Harvard University (MBA)",
      "spouse": "Maureen Braun",
      "contact": {
        "address": "200 W. Washington St., Rm. 206, Indianapolis, IN 46204",
        "phone": "317-232-4567"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.in.gov/gov/index.htm"
        },
        {
          "label": "State Website",
          "url": "https://www.in.gov/core/"
        }
      ],
      "about": [
        "Mike Braun is a conservative outsider who spent his career as a main street entrepreneur building a business and creating thousands of good-paying Hoosier jobs before being elected to the U.S. Senate in 2018. Mike has lived the American dream and his drive in becoming the next Governor of Indiana is to preserve the same freedom and opportunity to achieve prosperity for future generations of Hoosiers.",
        "After graduating from Jasper High School in 1972 as class president and a letterman in football, basketball, and track, he attended Wabash College. At Wabash, Mike graduated summa cum laude with a degree in economics and as student body president.",
        "After college, Mike married Maureen, his high school sweetheart, and the two moved to Boston where he attended Harvard Business School and earned his MBA. After business school, while the majority of Mike’s classmates took high-paying jobs on Wall Street, he chose to move back to Jasper to raise a family and build a career.",
        "After a few years working for a national kitchen cabinet company in Jasper, in 1981, Mike got the entrepreneurial itch and took over a struggling farm equipment manufacturer called Meyer Body. Over the next 20 years, Mike lived the hardscrabble existence of a small business owner with 15 employees and his office in a used mobile home.",
        "In the early 2000s, Meyer began to grow into a regional company and over the next 15 years grew into a national company that currently employs thousands of Americans with locations in 38 states. During his time growing a national company and serving in the US Senate, Mike never lost track of the lessons learned as a small business owner and has always kept the same main street values.",
        "The values of faith, family, and community guided Mike while growing a business and raising a family, and have inspired his call to serve fellow Hoosiers throughout the years. Mike began his public service as a member of the local School Board for ten years and then as a State Representative from 2014-2017.",
        "Mike has been a conservative voice for Hoosiers since his historic victory in the 2018 US Senate election, having led over 35 bills into law and was recently named the most effective first-term Republican Senator. Mike has also consistently been ranked as one of the most conservative members of the United States Senate, earning endorsements from Americans for Prosperity and CPAC, and maintains excellent ratings from the NRA, Family Research Council, National Right to Life, and Susan B. Anthony List.",
        "Mike is an avid outdoorsman and enthusiastic morel mushroom hunter every spring. Mike and Maureen have been married for 47 years and have four adult children and seven grandchildren."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/GMB-Official-Headshot-scaled.jpg",
      "photoLocalPath": "governors/in-mike-braun.jpg"
    }
  },
  {
    "state": "Iowa",
    "stateId": "IA",
    "sourceUrl": "https://www.nga.org/governors/iowa/",
    "scrapedAt": "2025-12-27T20:13:29.159Z",
    "governor": {
      "name": "Kim Reynolds",
      "party": "Republican",
      "terms": [
        "May 27, 2017 - January 15, 2019",
        "January 15, 2019 - January 13, 2023",
        "January 13, 2023 - Current"
      ],
      "born": "August 4, 1959",
      "birthState": "Iowa",
      "school": "Iowa State University",
      "spouse": "Kevin Reynolds",
      "contact": {
        "address": "Office of the Governor\nIowa State Capitol\n1007 East Grand Avenue\nDes Moines, IA 50319",
        "phone": "515-281-5211"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.iowa.gov/"
        },
        {
          "label": "State Website",
          "url": "https://www.iowa.gov/"
        }
      ],
      "about": [
        "Governor Kim Reynolds is the 43rd governor of Iowa and has the distinction of being the first woman elected to the state’s highest office.",
        "Governor Reynolds has a long-standing record of public service, having served four terms as Clarke County Treasurer before being elected to the Iowa Senate in November 2008. Two years later, as running mate of former Governor Terry Branstad, she was elected Lieutenant Governor and served nearly two terms before succeeding Branstad as Governor of Iowa in May 2017. She was elected in November 2018 to her first full term in office and re-elected in November 2022 to a second term.",
        "Governor Reynolds and her husband, First Gentleman Kevin Reynolds, have been married more than 40 years. They cherish spending time together as a family with their three daughters and sons-in-law, and 11 grandchildren.",
        "Governor Reynolds’ strong conservative values are reflected in her priorities for Iowa:",
        "Under her leadership, Iowans have benefitted from:",
        "Governor Reynolds is also respected nationally for her leadership on important issues ranging from education to economic growth, and has held a number of positions at the regional and national levels:"
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/Governor-Reynolds-2025-Headshot_square.jpg",
      "photoLocalPath": "governors/ia-kim-reynolds.jpg"
    }
  },
  {
    "state": "Kansas",
    "stateId": "KS",
    "sourceUrl": "https://www.nga.org/governors/kansas/",
    "scrapedAt": "2025-12-27T20:13:30.774Z",
    "governor": {
      "name": "Laura Kelly",
      "party": "Democratic",
      "terms": [
        "January 14, 2019 - January 9, 2023",
        "January 9, 2023 - Current"
      ],
      "born": "January 24, 1950",
      "birthState": "New York",
      "school": "Bradley University; Indiana University",
      "spouse": null,
      "contact": {
        "address": "Office of the Governor\nKansas Statehouse\n300 SW 10th Ave., Ste. 241S\nTopeka, KS 66612-1590",
        "phone": "785-296-3232"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.kansas.gov/"
        },
        {
          "label": "State Website",
          "url": "https://portal.kansas.gov/"
        }
      ],
      "about": [
        "Governor Laura Kelly grew up in a career military family where she learned the importance of service, integrity, and accountability. She has made it her life’s work to fight for children and families as a four-term state senator and now in her second term as the 48th Governor of the State of Kansas.",
        "In her first term, Governor Kelly worked with both parties to balance the budget, fully fund schools, repair the state’s infrastructure, reform the child welfare system, and break records for business investment and job creation. She ended her first term with the largest budget surplus in history – while eliminating the state sales tax on food and cutting property and income taxes for Kansas families.",
        "After putting Kansas back on track, Governor Kelly was re-elected to a second term, which began on January 9, 2023.",
        "Governor Kelly has set a North Star for her second term – to make Kansas the best place in the country to raise a family. She will continue to do this by prioritizing fiscal responsibility, creating programs to make housing and early childhood more affordable, attracting good paying jobs, providing access to high-speed internet, and implementing a long-term, sustainable water plan for Kansas.",
        "Governor Kelly has two grown daughters, Molly Daughety, MD, Kathleen Daughety and her husband Mathias Weiden, and one grandchild, Laura “Rory” Weiden."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/kelly_square.jpg",
      "photoLocalPath": "governors/ks-laura-kelly.jpg"
    }
  },
  {
    "state": "Kentucky",
    "stateId": "KY",
    "sourceUrl": "https://www.nga.org/governors/kentucky/",
    "scrapedAt": "2025-12-27T20:13:32.213Z",
    "governor": {
      "name": "Andy Beshear",
      "party": "Democratic",
      "terms": [
        "December 10, 2019 - December 11, 2023",
        "December 11, 2023 - Current"
      ],
      "born": "November 29, 1977",
      "birthState": "Kentucky",
      "school": "Vanderbilt University; University of Virginia School of Law",
      "spouse": "Britainy Beshear",
      "contact": {
        "address": "700 Capitol Avenue, Suite 100\nFrankfort, Kentucky 40601",
        "phone": "502-564-2611"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.ky.gov/Pages/index.aspx"
        },
        {
          "label": "State Website",
          "url": "https://kentucky.gov/Pages/home.aspx"
        }
      ],
      "about": [
        "From an early age, Governor Andy Beshear’s parents, former Governor Steve Beshear and First Lady Jane Be​​shear, along with his family and community, instilled in him the values of faith and public service.",
        "He has leaned on those values during his time as Governor, especially during the global pandemic and two historic natural disasters: the Western Kentucky tornadoes and the Eastern Kentucky floods.",
        "During the pandemic, he made it a priority to communicate directly with Kentuckians on how to stay safe by providing daily briefings that were broadcast online and on television. In each decision he made, he focused not on what was most popular, but on what would save lives.",
        "At first light after the tornadoes in 2021 and floods in 2022, he made a promise to be with the impacted communities until every home and every life was rebuilt. He is keeping that promise by helping secure hundreds of millions of dollars in state and federal aid and pushing for new homes for affected families. Now, thanks to millions of dollars in private donations raised by the Governor and with support from nonprofit organizations, more than 300 homes will be built or rehabilitated in the west, and seven new high-ground communities are being built in the east.",
        "The Governor is grateful to the health-care heroes, first responders, service members, educators, frontline workers, volunteers and neighbors who came to help their fellow Kentuckians face these and many other challenges.",
        "Under Governor Beshear’s leadership, Kentucky is rebuilding stronger than ever, and our economy is booming. Even as our state faced some of its toughest challenges, Gov. Beshear prioritized bringing good-paying jobs to every corner of the commonwealth.",
        "In his first term alone, he announced nearly $29 billion in private-sector investment – the largest amount secured by any Kentucky governor – and secured nearly 1,000 economic development projects creating nearly 51,300 full-time jobs.",
        "The best two years on record for economic development occurred under Gov. Beshear’s leadership. He landed the two biggest electric vehicle battery plants on planet Earth, making the commonwealth the EV battery production capital of the United States.",
        "As Governor, he has also secured record-high budget surpluses and record-low unemployment.",
        "On top of that, Gov. Beshear has moved major infrastructure projects forward, including building the Brent Spence Companion Bridge in Northern Kentucky, without tolls, the Mountain Parkway Expansion in Eastern Kentucky and the I-69 project in Western Kentucky. He has secured the largest investments in high-speed internet in our history, which will be used to connect every home and business in the state.",
        "Working with the General Assembly, Gov. Beshear has achieved things some people said would never be possible, like passing sports betting and legalizing medical cannabis. He and state legislators have also made transformational investments, like the $500 million Cleaner Water Program, which is providing clean drinking water to thousands of Kentuckians for the first time.",
        "The Governor’s administration has prioritized bringing new prosperity to every family and community, in every corner of the commonwealth.",
        "Governor Beshear has led an education-first administration and has worked tirelessly to protect public education and support teachers while making sure Kentuckians have access to affordable health care, which he believes is a basic human right.",
        "During his first week in office as Governor, he expanded access to health care for nearly 100,000 Kentuckians by eliminating governmental roadblocks. Later, he relaunched kynect and further expanded Medicaid to help more families get access to health care. During his administration, health care is expanding all over the commonwealth, including the construction of the first hospital in West Louisville in 150 years.",
        "With Gov. Beshear’s fight to combat addiction, in 2022 Kentucky was one of only eight states to see a decrease in drug overdose deaths During his administration, treatment beds for Kentuckians in recovery increased by 50%.",
        "The Governor’s work in his first term built on his record of fighting for Kentucky families throughout his legal career and as Kentucky’s 50th Attorney General. As Attorney General, he fought against the opioid epidemic by suing more opioid manufacturers and distributors than any other Attorney General. Under his leadership, the office arrested record numbers of child predators, ended Kentucky’s rape kit backlog, protected seniors from scams, fraud and abuse and fought and won to protect the hard-earned pensions of Kentucky’s teachers.",
        "In his second term, Gov. Beshear is committed to continuing to move the state forward by working together to turn four years of progress into decades of prosperity for generations to come. The Governor is committed to working with Kentuckians to build that better Kentucky – one where our children never have to leave home to chase their dreams.",
        "The Governor and his wife, First Lady Britainy Beshear, along with their two children, Will and Lila, live in Frankfort and are members of Louisville’s Beargrass Christian Church."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/12/Governor-Beshear_Official-Picture_square-scaled.jpg",
      "photoLocalPath": "governors/ky-andy-beshear.jpg"
    }
  },
  {
    "state": "Louisiana",
    "stateId": "LA",
    "sourceUrl": "https://www.nga.org/governors/louisiana/",
    "scrapedAt": "2025-12-27T20:13:33.779Z",
    "governor": {
      "name": "Jeff Landry",
      "party": "Republican",
      "terms": [
        "January 8, 2024 - Current"
      ],
      "born": "December 23, 1970",
      "birthState": "Louisiana",
      "school": "University of Louisiana at Lafayette, Loyola University New Orleans College of Law",
      "spouse": "Sharon Landry",
      "contact": {
        "address": "Office of the Governor\nPO Box 94004\nBaton Rouge, LA 70804",
        "phone": "225-342-0991"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://gov.louisiana.gov/"
        },
        {
          "label": "State Website",
          "url": "http://louisiana.gov/"
        }
      ],
      "about": [
        "Jeff Landry’s love for our state, and his passion for helping others is defined by his Louisiana roots. Jeff grew up in the small town of St. Martinville where his mother was a schoolteacher and his parents took him to church every day. Later, Jeff learned the value of hard work in the sugar cane fields and then proudly joined the National Guard, serving in Operation Desert Storm. After returning home, Jeff worked as a police officer and sheriff’s deputy, and later started a successful business and went to law school.",
        "As a public servant, both as a U.S. Congressman and the Attorney General of Louisiana, Jeff Landry has shown strength and courage fighting for common sense values and bringing people together to deliver solutions.",
        "On October 14, 2023 Jeff Landry was elected to become the 57th Governor of Louisiana in a historic primary victory. On January 8th, 2024, he assumed office.",
        "As Governor, he will not be afraid to make the changes necessary to turn Louisiana around, deliver results, and fight for working families.",
        "Jeff resides in Broussard, Louisiana with his wife, Sharon, and their son, JT."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2024/01/Governor-Landry-Official-Portrait_square-scaled.jpg",
      "photoLocalPath": "governors/la-jeff-landry.jpg"
    }
  },
  {
    "state": "Maine",
    "stateId": "ME",
    "sourceUrl": "https://www.nga.org/governors/maine/",
    "scrapedAt": "2025-12-27T20:13:35.256Z",
    "governor": {
      "name": "Janet Mills",
      "party": "Democratic",
      "terms": [
        "January 2, 2019 - January 4, 2023",
        "January 4, 2023 - Current"
      ],
      "born": "December 30, 1947",
      "birthState": "Maine",
      "school": "University of Massachusetts at Boston, University of Maine School of Law",
      "spouse": null,
      "contact": {
        "address": "1 State House Station\nAugusta, ME 04333",
        "phone": "207-287-3531"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.maine.gov/governor/mills/"
        },
        {
          "label": "State Website",
          "url": "https://www.maine.gov/portal/index.html"
        }
      ],
      "about": [
        "Janet Trafton Mills was sworn in as the 75th Governor of Maine on January 2, 2019.",
        "Governor Mills is the first woman governor of Maine. In her historic victories, she earned more votes than any governor in Maine history and is the first governor since 1970 to be elected with a majority of the vote for both terms in office.",
        "As Governor, she led Maine through a global pandemic with nation-leading results, including one of the highest vaccination rates and one of the lowest death rates in the country, protecting the lives and livelihoods of Maine people.",
        "Under her leadership, Maine’s GDP has experienced the strongest GDP growth in New England and outperformed the economic growth of larger states like California, New York, and Virginia. In fact, Maine has experienced more economic growth over the last four years than it did in the preceding fifteen.",
        "She has expanded health care to more than 100,000 Maine people, cut the uninsured rate by more than any other state in the nation, fully funded schools for the first time in Maine history, raised the minimum teacher salary, delivered free community college, cut taxes for Maine retirees, increased the Rainy Day Fund to more than $900 million, and provided significant tax relief for Maine people, among many other bipartisan accomplishments.",
        "Through her Maine Jobs & Recovery Plan, she is focused on addressing Maine’s longstanding workforce shortage, investing millions of dollars workforce supports including education and training, childcare, housing and healthcare, and broadband expansion.",
        "Governor Mills was born in Farmington, Maine, which she still proudly calls home today. The granddaughter of Aroostook County potato farmers and the daughter of a long-time high school English teacher and U.S. Attorney for Maine, she learned the value of hard-work at an early age, venturing out in the early morning to deliver newspapers and serving meals in the evening at the local diner. She graduated from Mt. Blue High School in Farmington, the University of Massachusetts at Boston, and the University of Maine School of Law.",
        "In 1985, she met and married the love of her life, her husband, Stan Kuklinski, a widower with five young daughters ages four to sixteen. They moved back to Farmington, and she became a full-time parent and helped raise their daughters while working full-time herself. She is now the proud grandmother to three grandsons and two granddaughters. Following a devastating stroke, Stan passed away in 2014.",
        "Janet first entered public service as an Assistant Attorney General, where she prosecuted homicides and other major crimes. She later was elected District Attorney for Androscoggin, Franklin and Oxford Counties, the first woman to be elected as a DA in New England. In that role, she saw firsthand how the criminal justice system frequently failed victims of domestic violence. Frustrated by the Legislature’s failure to act, she co-founded the Maine Women’s Lobby to advocate for battered and abused women and won election to the Maine House of Representatives herself in 2002.",
        "In 2008, she was elected by her colleagues to serve as Attorney General of Maine, the first and only woman to hold the job. She served as Attorney General from 2009 to 2011 and again from 2013 to 2019. As Attorney General, she made it her mission to stand up to those who have tried to exploit Maine people–from fighting dishonest mortgage lending companies to help keep Maine people in their homes, to fighting big Pharma for their role in creating the opioid crisis and then using that money to purchase overdose-reversal kits that have saved more than 1,000 lives, to fighting to protect health care coverage for young adults.",
        "As governor, she is fighting to see that every Maine person has affordable, high-quality health care, that Maine has a strong economy with good-paying jobs in every part of the state, that every Maine child has access to a world-class education, and that Maine is a place where families can put down roots and raise their kids.",
        "She is a pragmatic problem-solver, focused on bringing Democrats, Republicans, and Independents together to find consensus and move Maine forward – strongly believing that no one has a monopoly on good ideas."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/3218_Gov-Janet-Mills-20230307_square-scaled.jpg",
      "photoLocalPath": "governors/me-janet-mills.jpg"
    }
  },
  {
    "state": "Maryland",
    "stateId": "MD",
    "sourceUrl": "https://www.nga.org/governors/maryland/",
    "scrapedAt": "2025-12-27T20:13:36.921Z",
    "governor": {
      "name": "Wes Moore",
      "party": "Democratic",
      "terms": [
        "January 18, 2023 - Current"
      ],
      "born": "October 15, 1978",
      "birthState": "Maryland",
      "school": "Valley Forge Military College, Johns Hopkins University",
      "spouse": "Dawn Moore",
      "contact": {
        "address": "100 State Circle\nAnnapolis, Maryland 21401-1925​",
        "phone": "410-974-3901"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.maryland.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.maryland.gov/Pages/default.aspx"
        }
      ],
      "about": [
        "Wes Moore is the 63rd Governor of the state of Maryland. He is Maryland’s first Black Governor in the state’s 246-year history, and is just the third African American elected Governor in the history of the United States.",
        "Born in Takoma Park, Maryland, on October 15, 1978, to Joy and Westley Moore, Moore’s life took a tragic turn when his father died of a rare, but treatable virus when he was just three years old. After his father’s death, his family moved to the Bronx to live with Moore’s grandparents before returning to Maryland at age 14.",
        "Moore is a proud graduate of Valley Forge Military Academy and College, where he received an Associate’s degree in 1998, and was commissioned as a second lieutenant in the U.S. Army. Afterward, he went on to earn his Bachelor’s in international relations and economics at Johns Hopkins University in Baltimore, where he graduated Phi Beta Kappa.",
        "While at Johns Hopkins, Moore interned in the office of former Baltimore Mayor Kurt Schmoke. Moore was the first Black Rhodes Scholar in the history of Johns Hopkins University. As a Rhodes Scholar, he earned a Master’s in international relations from Wolfson College at Oxford.",
        "In 2005, Moore deployed to Afghanistan as a lieutenant with the 82nd Airborne Division, leading soldiers in combat. Immediately upon returning home, Moore served as a White House Fellow, advising on issues of national security and international relations.",
        "In 2010, Moore wrote “The Other Wes Moore,” a story about the fragile nature of opportunity in America, which became a perennial New York Times bestseller. He went on to write other best-selling books that reflect on issues of race, equity, and opportunity, including his latest book “Five Days,” which tells the story of Baltimore in the days that followed the death of Freddie Gray in 2015.",
        "Moore built and launched a Baltimore-based business called BridgeEdU, which reinvented freshman year of college for underserved students to increase their likelihood of long-term success. BridgeEdu was acquired by the Brooklyn-based student financial success platform, Edquity, in 2018.",
        "It was Moore’s commitment to taking on our toughest challenges that brought him to the Robin Hood Foundation, where he served for four years as CEO. During his tenure, the Robin Hood Foundation distributed over $600 million toward lifting families out of poverty, including here in Maryland.",
        "While the Robin Hood Foundation is headquartered in New York City, Wes and his family never moved from their home in Baltimore.",
        "Moore has also worked in finance with Deutsche Bank in London and with Citigroup in New York.",
        "Moore and his wife, First Lady Dawn Flythe Moore​, have two children – Mia, 13; and James, 11 –​ and a dog, Tucker Balti.",
        "The Governor is the current Vice Chair of the National Governors Association."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/governor-wes-moore-official-portrait_square.jpg",
      "photoLocalPath": "governors/md-wes-moore.jpg"
    }
  },
  {
    "state": "Massachusetts",
    "stateId": "MA",
    "sourceUrl": "https://www.nga.org/governors/massachusetts/",
    "scrapedAt": "2025-12-27T20:13:38.432Z",
    "governor": {
      "name": "Maura Healey",
      "party": "Democratic",
      "terms": [
        "January 5, 2023 - Current"
      ],
      "born": "February 8, 1971",
      "birthState": "Maryland",
      "school": "Harvard University, Northeastern University",
      "spouse": "Joanna Lydgate",
      "contact": {
        "address": "Massachusetts State House, 24 Beacon St.\nOffice of the Governor, Room 280\nBoston, MA 02133",
        "phone": "617-725-4005"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.mass.gov/orgs/office-of-the-governor"
        },
        {
          "label": "State Website",
          "url": "https://www.mass.gov/"
        }
      ],
      "about": [
        "Maura Healey is the 73rd Governor of Massachusetts. In 2022, she became the state’s first woman and first openly LGBTQ person elected to the position.",
        "In her first year as Governor, Healey has already delivered on key promises to help Massachusetts become a leader in clean energy, a more affordable and equitable place to live, and a great place for businesses to operate.",
        "On her first day in office, Governor Healey appointed the nation’s first cabinet-level Climate Chief and created the Office of Climate Innovation & Resilience to coordinate policies across all of state government to address the climate crisis. Governor Healey has also prioritized education and workforce development with free school meals for K-12 students, cost-free community college for Massachusetts residents and career apprenticeships accessible to more students and workers. Governor Healey also delivered on her promise to make Massachusetts more affordable by cutting taxes for the first time in 20 years, including the most generous Child and Family Tax Credit in the country. Her tax cuts put money back into the pockets of families, renters, seniors and others who are struggling to keep up with the rising cost of living. She filed and signed the $5 billion Affordable Homes Act, the state’s largest ever housing investment, to create tens of thousands of homes and lower costs; and the $4 billion Mass Leads Act, to invest in Massachusetts businesses, create good jobs, and keep the state’s innovation economy the best in the world.",
        "Healey previously served two terms as Massachusetts Attorney General, first elected in 2014 and re-elected in 2018. In her role as the People’s Lawyer, she took on difficult issues impacting Massachusetts residents, including the opioid epidemic, the climate crisis, escalating health care costs, and student loan debt. Earlier in her career, Healey was a litigation partner at an international law firm.",
        "Healey grew up the oldest of five siblings in an old New England farmhouse. She and her siblings were raised by their mother, Tracy, who worked as a nurse at the local elementary school. Her stepfather, Edward, who later joined the family, was a teacher and local union president. He coached her high school basketball team and instilled a lifelong love of the sport. Healey attended Harvard College, where she captained the basketball team, and then spent two years as a 5’4” starting point guard on a professional basketball team in Austria.",
        "For much of her career, she’s been the only woman in the room and has taken every opportunity to elevate other women. She is a passionate advocate for LGBTQ rights, women’s health, and women’s equality in general, especially in sports.",
        "Governor Healey lives in Arlington, Massachusetts with her partner, Joanna Lydgate."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/Maura_Healey_square.jpg",
      "photoLocalPath": "governors/ma-maura-healey.jpg"
    }
  },
  {
    "state": "Michigan",
    "stateId": "MI",
    "sourceUrl": "https://www.nga.org/governors/michigan/",
    "scrapedAt": "2025-12-27T20:13:40.013Z",
    "governor": {
      "name": "Gretchen Whitmer",
      "party": "Democratic",
      "terms": [
        "January 1, 2019 - January 1, 2023",
        "January 1, 2023 - Current"
      ],
      "born": "August 23, 1971",
      "birthState": "Michigan",
      "school": "Michigan State University, Michigan State University College of Law",
      "spouse": "Marc Mallory",
      "contact": {
        "address": "P.O. Box 30013\nLansing, Michigan 48909",
        "phone": "517-335-7858"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.michigan.gov/whitmer/"
        },
        {
          "label": "State Website",
          "url": "https://www.michigan.gov/"
        }
      ],
      "about": [
        "Governor Gretchen Whitmer is a lifelong Michigander focused on getting things done that will make a real difference in people’s lives.",
        "She has signed over 1,380 bipartisan bills and six balanced budgets. From cutting taxes for seniors and working families to put hundreds of dollars back in their pockets and investing in schools to improve student outcomes to fixing 23,000 lane miles of the damn roads, Governor Whitmer delivers on the fundamentals.",
        "By lowering the cost of job training and higher education, fostering innovation, cutting red tape for permitting and redevelopment, putting Michigan in the lead on clean energy, and competing with other states and nations, Governor Whitmer has made Michigan one of America’s best states to do business, attracted investments from around the world, and maintained a strong credit rating.",
        "Since day one, her administration has gone everywhere and worked with anyone to make Michigan the best state to live, work, and invest. Whether you’re a family looking to start a life with more affordable health care and housing, a business looking to expand with a skilled workforce, or a young person seeking a path to a brighter future with more personal freedoms, Governor Whitmer is focused on building a safer, more welcoming Michigan with a place for you.",
        "Governor Whitmer works alongside three dynamic statewide leaders: Lieutenant Governor Garlin Gilchrist, Attorney General Dana Nessel, and Secretary of State Jocelyn Benson. She lives in Lansing with her husband Dr. Marc Mallory and Kevin & Doug, the First Dogs of Michigan. She has two daughters and three stepsons. Governor Whitmer earned a bachelor’s and law degree from Michigan State University."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/GovWhitmerPortMaster_square-scaled.jpg",
      "photoLocalPath": "governors/mi-gretchen-whitmer.jpg"
    }
  },
  {
    "state": "Minnesota",
    "stateId": "MN",
    "sourceUrl": "https://www.nga.org/governors/minnesota/",
    "scrapedAt": "2025-12-27T20:13:41.546Z",
    "governor": {
      "name": "Tim Walz",
      "party": "Democratic",
      "terms": [
        "January 7, 2019 - January 2, 2023",
        "January 2, 2023 - Current"
      ],
      "born": "April 6, 1964",
      "birthState": "Nebraska",
      "school": null,
      "spouse": "Gwen Walz",
      "contact": {
        "address": "130 State Capitol\n75 Rev Dr. Martin Luther King Jr. Blvd.\nSt. Paul, MN 55155",
        "phone": "651-201-3400"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://mn.gov/governor/"
        },
        {
          "label": "State Website",
          "url": "https://mn.gov/portal/"
        }
      ],
      "about": [
        "Tim Walz is Minnesota’s 41st Governor. He was first elected Governor in 2018 and won re-election in 2022. Accomplishments from his time as Governor include providing universal free school meals for students, protecting reproductive freedom, strengthening voting rights, laying the groundwork to get Minnesota to 100% clean electricity by 2040, cutting taxes for the middle class, and expanding paid leave for Minnesota workers. Throughout his time as Governor, Tim has prioritized making Minnesota the best state in the country to raise a family.",
        "Born in a small town in rural Nebraska, Tim’s parents instilled in him the values of public service, generosity toward your neighbors, and working for the common good that guide his commitment to Minnesota today. After high school graduation, Tim enlisted in the Army National Guard. He attended Chadron State College and graduated with a social science degree in 1989. Tim spent a year teaching abroad before returning home to serve full time in the Army National Guard and eventually accepting a high school teaching and coaching position.",
        "While teaching, Tim met his future wife, Gwen Whipple, who taught at the same school. They moved to Mankato in 1996, where they worked at Mankato West High School. In addition to teaching social studies, Tim helped coach the Mankato West football team that won the school’s first state championship. After 24 years in the Army National Guard, Command Sergeant Major Walz retired from the 1-125th Field Artillery Battalion in 2005. Tim won his first election to the United States House of Representatives in 2006 and was re-elected for another five terms serving Minnesota’s First Congressional District in Southern Minnesota."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/Governor-Walz-2024_square.jpg",
      "photoLocalPath": "governors/mn-tim-walz.jpg"
    }
  },
  {
    "state": "Mississippi",
    "stateId": "MS",
    "sourceUrl": "https://www.nga.org/governors/mississippi/",
    "scrapedAt": "2025-12-27T20:13:43.116Z",
    "governor": {
      "name": "Tate Reeves",
      "party": "Republican",
      "terms": [
        "January 14, 2020 - Current"
      ],
      "born": "June 5, 1974",
      "birthState": "Mississippi",
      "school": "Millsaps College",
      "spouse": "Elee Reeves",
      "contact": {
        "address": "P.O. Box 139\nJackson, MS 39205",
        "phone": "601-359-3150"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governorreeves.ms.gov/"
        },
        {
          "label": "Governor's Bio",
          "url": "https://governorreeves.ms.gov/about/"
        },
        {
          "label": "State Website",
          "url": "https://www.mississippi.org/"
        }
      ],
      "about": [
        "As the 65th Governor of Mississippi, Tate Reeves continues to build on his strong record as a conservative leader who fights to guard taxpayers’ dollars, improve educational opportunity, and grow new careers so that our state’s best and brightest can raise their families and thrive here at home.",
        "In his inaugural address, Governor Reeves promised that this would be an administration for all Mississippi. He committed to a mission to create a climate where good careers are plentiful with every Mississippian prepared to pursue them, as he has every single day of his time serving our state.",
        "Upon taking office, Governor Reeves inherited a crumbling corrections department and a scandal-plagued human services department. He took immediate action to stem the existing issues and begin the process of rebuilding, shedding light on the issues and installing the best leadership to help him turn the departments around to work for the people of Mississippi.",
        "While tackling the inherited issues within government agencies to provide for the safety and human dignity of all Mississippians, Governor Reeves simultaneously led our state through historic flooding and tornadoes and a worldwide pandemic—all within his first 100 days in office.",
        "Governor Reeves has continued to make history throughout his public service career. When elected in 2003 for his first public office, Governor Reeves became the youngest state treasurer in our country and the first Republican to hold the office in Mississippi. His business training in the banking sector made him our state’s foremost advocate for balancing the state budget while minimizing state debt.",
        "He was elected in 2011 and re-elected four years later as the 32nd Lieutenant Governor, leading the Mississippi Senate. His conservative management helped fill our state’s Rainy Day Fund to over $550 million—the most in state history—and reduce the overall debt burden. He fought for transparency in how agencies spend tax dollars and stronger reporting requirements on taxpayer-funded incentive programs.",
        "His commitment to long-term growth that creates better careers led Governor Reeves to propose the largest tax cut in state history through the Taxpayer Pay Raise Act, lowering the personal income tax and enabling more Mississippi employers to invest in jobs and better compete in the global marketplace.",
        "Governor Reeves’ upbringing in Florence’s public schools made him driven to reform the education system to increase opportunity for all Mississippians. He has worked to increase investment in the classroom and enacted reforms to save money, strengthen achievement, and effectively communicate school performance. His new mission for our state is to give us more national board-certified teachers per capita than any state in the nation.",
        "Governor Reeves remains committed to his inaugural promise to defend the loving culture that underpins our quality of life and grow our economy that lifts all of our families. He has pledged to work every day to make that promise a reality for all Mississippi.",
        "A Rankin County native, Governor Reeves is a graduate of Florence High School and an honors graduate of Millsaps College, where he earned a bachelor’s degree in economics. He holds the Chartered Financial Analyst designation.",
        "Governor Reeves and his wife, Elee, are the proud parents of three daughters, Tyler, Emma, and Maddie."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2020/01/headshot-governor-tate-reeves_R_square.jpg",
      "photoLocalPath": "governors/ms-tate-reeves.jpg"
    }
  },
  {
    "state": "Missouri",
    "stateId": "MO",
    "sourceUrl": "https://www.nga.org/governors/missouri/",
    "scrapedAt": "2025-12-27T20:13:44.767Z",
    "governor": {
      "name": "Mike Kehoe",
      "party": "Republican",
      "terms": [
        "January 13, 2025 - Current"
      ],
      "born": "January 17, 1962",
      "birthState": "Missouri",
      "school": "Chaminade College Preparatory School",
      "spouse": "Claudia Kehoe",
      "contact": {
        "address": "P.O. Box 720\nJefferson City, MO 65102",
        "phone": "573-751-3222"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.mo.gov/"
        },
        {
          "label": "State Website",
          "url": "https://www.mo.gov/"
        }
      ],
      "about": [
        "Mike Kehoe was sworn in as Missouri’s 58th Governor on January 13, 2025. Guided by a lifelong dedication to public service and a commitment to Missouri families, Governor Kehoe has made public safety, education, economic development, and agriculture the cornerstones of his administration.",
        "Raised as the youngest of six children by a single mother who worked tirelessly to support her family, Governor Kehoe learned the value of hard work and resilience at an early age. Starting his career washing cars at 15, he advanced through the automotive industry to become one of the youngest Ford dealers in the nation. Later, he turned around Osage Industries, a struggling ambulance manufacturing company in Linn, Missouri, transforming the business into one of the largest ambulance manufacturers in the nation.",
        "The Governor’s entrepreneurial success and leadership skills in his early career naturally drew him to public service, where he could use his experience to improve the lives of Missouri families and strengthen the state’s economy.",
        "During his four-and-a-half years on the Missouri Highway & Transportation Commission, Governor Kehoe’s leadership played a critical role in improving the state’s infrastructure and elevating Missouri’s road system from among the worst in the nation to one of the best. In 2010, he was elected to the Missouri Senate, where he worked to balance budgets, fully fund schools, and champion laws protecting Missouri’s children and seniors. As Senate Majority Floor Leader, he advocated for reducing regulatory burdens, cutting taxes, and creating jobs.",
        "Throughout his term as Missouri’s 47th Lieutenant Governor, Governor Kehoe highlighted Missouri’s businesses, agriculture, and tourism while serving as a voice for veterans and seniors.",
        "As a first generation-farmer and passionate champion of Missouri agriculture, Governor Kehoe owns and operates a 700-acre cattle farm in Phelps and Pulaski counties with his wife, Claudia. The Kehoes are proud parents of four adult children and soon-to-be-grandparents.",
        "Governor Kehoe’s priorities reflect his unwavering commitment to the people of Missouri: ensuring safe communities, advancing education, fostering economic growth, and supporting the backbone of the state’s economy—agriculture."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Governor-Mike-Kehoe_square-scaled.jpg",
      "photoLocalPath": "governors/mo-mike-kehoe.jpg"
    }
  },
  {
    "state": "Montana",
    "stateId": "MT",
    "sourceUrl": "https://www.nga.org/governors/montana/",
    "scrapedAt": "2025-12-27T20:13:45.958Z",
    "governor": {
      "name": "Greg Gianforte",
      "party": "Republican",
      "terms": [
        "January 4, 2021 - January 6, 2025",
        "January 6, 2025 - Current"
      ],
      "born": "April 17, 1961",
      "birthState": "California",
      "school": null,
      "spouse": "Susan Gianforte",
      "contact": {
        "address": "P.O. Box 200801\nHelena, MT 59620-0801",
        "phone": "406-444-3111"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.mt.gov/"
        },
        {
          "label": "State Website",
          "url": "https://mt.gov/"
        }
      ],
      "about": [
        "Starting his first business when he was in high school, Governor Greg Gianforte has spent his career creating jobs. In 1997, Greg and Susan Gianforte founded RightNow Technologies from their Bozeman home and grew it into the town’s largest commercial employer, creating over 500 high-paying Montana jobs.",
        "After 34 years in the private sector, Greg Gianforte was elected Montana’s 25th governor in November 2020, earning more votes than any candidate for governor in Montana history and with the largest margin of victory for a first-term governor since 1920. Reelected in November 2024, Governor Gianforte is the first Republican to take office for a second term since 1996.",
        "Governor Gianforte’s experience as a businessman and entrepreneur guides his focus on expanding opportunities for Montanans, creating good-paying jobs, and protecting the Montana way of life. Governor Gianforte has delivered historic tax cuts, made Montana debt-free, provided record funding for education, raised teacher pay, boosted funding for law enforcement, and increased public access to more than 100,000 acres of public lands.",
        "Under Governor Gianforte’s leadership, more Montanans are working than ever before, unemployment is at record lows, and Montana has set new records in job and business creation.",
        "Married since 1988, Greg and Susan Gianforte raised their four children in Bozeman hunting, fishing, rafting, climbing, skiing and backpacking on Montana’s public lands."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2020/11/Montana-Greg-Gianforte-January-2021.jpg",
      "photoLocalPath": "governors/mt-greg-gianforte.jpg"
    }
  },
  {
    "state": "Nebraska",
    "stateId": "NE",
    "sourceUrl": "https://www.nga.org/governors/nebraska/",
    "scrapedAt": "2025-12-27T20:13:47.290Z",
    "governor": {
      "name": "Jim Pillen",
      "party": "Republican",
      "terms": [
        "January 5, 2023 - Current"
      ],
      "born": "December 31, 1955",
      "birthState": "Nebraska",
      "school": "University of Nebraska, Lincoln | Kansas State University",
      "spouse": "Suzanne Pillen",
      "contact": {
        "address": "PO Box 94848\nLincoln, NE 68509-4848",
        "phone": "402-471-2244"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.nebraska.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.nebraska.gov/"
        }
      ],
      "about": [
        "Governor Jim Pillen was sworn in as Nebraska’s 41st Governor on January 5, 2023.",
        "He entered office with the goal of protecting, training, and keeping our kids in Nebraska, cutting taxes, growing agriculture, and defending our commonsense, conservative values.",
        "Governor Pillen grew up on a farm in Platte County, Nebraska and raised pigs with his father, Dale. He graduated from Lakeview High School.",
        "He earned a Bachelor’s Degree in Animal Science from UNL, and married Suzanne Shreve. Governor Pillen then earned a doctor of veterinary medicine from Kansas State. In 1983, he returned to Nebraska and opened a small animal practice and swine consulting practice.",
        "Governor Pillen and his father, Dale, partnered together, raising 60 sows and 1,200 market hogs on a dirt lot on their home farm. In 1993, Jim started Pillen Family Farms. In 2003, he added DNA Genetics. In 2010, his two oldest children, Sarah and Brock, joined the business.",
        "Pillen Family Farms and DNA Genetics are now a multigenerational family-run business, composed of over 1,100 team members. The family business operates by some basic core beliefs—do what is right, do the best you can, and treat others the way you want to be treated.",
        "Jim and wife, Suzanne, have four children, Sarah, Brock, Polly and Izic, and seven grandchildren, William, Halle, Eloise, Henry, Harrison, Ava, and Thomas."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/headshot-pillen.jpg",
      "photoLocalPath": "governors/ne-jim-pillen.jpg"
    }
  },
  {
    "state": "Nevada",
    "stateId": "NV",
    "sourceUrl": "https://www.nga.org/governors/nevada/",
    "scrapedAt": "2025-12-27T20:13:49.058Z",
    "governor": {
      "name": "Joe Lombardo",
      "party": "Republican",
      "terms": [
        "January 2, 2023 - Current"
      ],
      "born": "November 8, 1962",
      "birthState": "Other",
      "school": "University of Nevada, Las Vegas",
      "spouse": "Donna Lombardo",
      "contact": {
        "address": "State Capitol Building\n101 N. Carson Street\nCarson City, NV 89701",
        "phone": "775-684-5670"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://gov.nv.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.nv.gov/"
        }
      ],
      "about": [
        "Born in Japan in a military family, Governor Joe Lombardo spent his childhood growing up across the world, until his father was stationed at Nellis Air Force Base and his family put down roots in Las Vegas.",
        "Governor Lombardo attended Rancho High School in North Las Vegas, before going on to attend the University of Nevada, Las Vegas, where he earned his Bachelor of Science degree. After graduating, he served in the United States Army and in the Nevada National Guard.",
        "Following his military service, Governor Lombardo joined the Las Vegas Metropolitan Police Department (LVMPD), where he quickly rose through the ranks and served on nearly every level of LVMPD, from detective to assistant sheriff. While serving at LVMPD, Governor Lombardo earned his Master of Science in Crisis Management from the University of Nevada, Las Vegas in 2006.",
        "After 26 years on the force, Governor Lombardo was elected as Sheriff of Clark County in 2014 and re-elected in 2018. As the sheriff of Nevada’s largest county, he oversaw a $1.3 billion dollar budget, 6,000 employees, and LVMPD’s efforts to protect millions of Clark County residents and visitors each day.",
        "Governor Lombardo was elected as the 31st Governor of Nevada in November 2022 and sworn into office in January 2023. Governor Lombardo is focused on diversifying and revitalizing Nevada’s economy, restoring law and order in communities across the state, and bringing excellence, school choice, and accountability to Nevada’s education system.",
        "More important to him than anything, Governor Lombardo is a devoted husband to First Lady Donna Lombardo, a dedicated father to his daughter Morgan, stepdaughter Lacey, stepson Jackson, and a grandfather to his young grandson Theodore."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/Governor-Joe-Lombardo_Official-Photo-scaled.jpg",
      "photoLocalPath": "governors/nv-joe-lombardo.jpg"
    }
  },
  {
    "state": "New Hampshire",
    "stateId": "NH",
    "sourceUrl": "https://www.nga.org/governors/new-hampshire/",
    "scrapedAt": "2025-12-27T20:13:50.827Z",
    "governor": {
      "name": "Kelly Ayotte",
      "party": "Republican",
      "terms": [
        "January 9, 2025 - Current"
      ],
      "born": "June 27, 1968",
      "birthState": "New Hampshire",
      "school": "Pennsylvania State University (BA); Villanova University (JD)",
      "spouse": "Joseph Daley",
      "contact": {
        "office of the governor": "State House\n107 North Main Street\nConcord, NH 03301",
        "phone": "603-271-2121"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.governor.nh.gov/"
        },
        {
          "label": "State Website",
          "url": "https://www.nh.gov/"
        }
      ],
      "about": [
        "Kelly ran for Governor to keep New Hampshire safe, prosperous and free. As a lifelong Granite Stater, Kelly knows that New Hampshire is the best state in the country to live, work and raise a family, and she will work hard every day to make New Hampshire even better",
        "Growing up in Nashua, Kelly learned the only way to achieve success is by working hard. Kelly’s first job was bussing tables during the Summer at Mame’s Restaurant in Meredith. She worked her way through college receiving a Bachelor of Arts with honors from the Pennsylvania State University and her law degree from Villanova University.",
        "Coming from a military family, Kelly deeply appreciates the sacrifices made by New Hampshire’s many veterans, service members, and their loved ones. Her husband, Joe, was an A-10 Warthog pilot who retired from the Air Force as a Lieutenant Colonel. Kelly and Joe got married right before September 11, 2001, and after they returned from their honeymoon, Joe deployed to the Middle East to defend our nation. Their daughter, Kate, is now a Cadet at the United States Air Force Academy.",
        "Kelly has dedicated her life to public service. In 2004, Kelly made history when she became New Hampshire’s first female Attorney General. First appointed to that position by a Republican governor, she was twice reappointed by a Democratic governor. As New Hampshire’s Chief Law Enforcement Officer, Kelly worked every day to protect the freedom, rights, and safety of Granite Staters, and she stood shoulder to shoulder with New Hampshire’s law enforcement officers. In 2006, Kelly successfully prosecuted the horrific murder case of Manchester Police Officer Michael Briggs, resulting in a conviction and death penalty sentence for his killer. Kelly also served as the Deputy Attorney General, Chief of the Homicide Prosecution Unit – New Hampshire’s top murder prosecutor, and as Legal Counsel to Governor Craig Benson.",
        "Kelly was elected by the people of New Hampshire to represent them in the United States Senate in 2010 and was ranked one of the most bipartisan senators, working across the aisle to find solutions to our nation’s biggest challenges. She worked to protect our national security, rein in wasteful spending, and led the effort to pass the Comprehensive Addiction and Recovery Act to address the opioid epidemic. In 2017, she served as the “Sherpa” for Judge Neil Gorsuch, leading the effort for the Trump Administration to secure his confirmation as an Associate Justice to the United States Supreme Court.",
        "Kelly understands the importance of small businesses and job creation to New Hampshire’s economy. She helped her husband, Joe, start a landscaping and snow removal business, shoveling snow by night and then going to work her day job as a murder prosecutor. She also spent several years working with companies in New Hampshire and across the country, including Chairing the Board of BAE Systems, Inc., New Hampshire’s largest manufacturing employer, and Cirtronics, an employee-owned manufacturing company in Milford. She appreciates the important role non-profit organizations play in New Hampshire and has served on several non-profit boards, including Swim with a Mission, Veterans Count, and the School Board of Saint Christopher Academy in Nashua.",
        "Kelly continues to reside in her hometown of Nashua, New Hampshire, with her husband, Joe, and two children, Kate and Jake. Kelly believes that New Hampshire’s greatest strength is the passion, capabilities, and independence of its people. As Governor, she will wake up every day and give her all to serve the wonderful people of New Hampshire to ensure that the Granite State remains the very best state in the nation."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/ayotte_portrait-for-online.jpg",
      "photoLocalPath": "governors/nh-kelly-ayotte.jpg"
    }
  },
  {
    "state": "New Jersey",
    "stateId": "NJ",
    "sourceUrl": "https://www.nga.org/governors/new-jersey/",
    "scrapedAt": "2025-12-27T20:13:52.340Z",
    "governor": {
      "name": "Phil Murphy",
      "party": "Democratic",
      "terms": [
        "January 16, 2018 - January 18, 2022",
        "January 18, 2022 - Current"
      ],
      "born": "August 16, 1957",
      "birthState": "Massachusetts",
      "school": "University of Pennsylvania, Wharton School of the University of Pennsylvania, Harvard University",
      "spouse": "Tammy Snyder Murphy",
      "contact": {
        "address": "The State House\nP.O. Box 001\nTrenton, NJ 08625",
        "phone": "609-292-6000"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://www.state.nj.us/governor/"
        },
        {
          "label": "State Website",
          "url": "http://www.state.nj.us/"
        }
      ],
      "about": [
        "Philip D. Murphy took the oath of office as New Jersey’s 56th Governor on January 16, 2018. After being re-elected in November 2021, Governor Murphy became the first Democratic Governor in New Jersey to serve a second term in 44 years.",
        "Since taking office in 2018, Governor Murphy has focused on building a stronger, fairer, and more affordable New Jersey for every family. Under his leadership, New Jersey has taken strides in achieving record-high economic growth, expanding critical investments to lower costs for working families, restoring fiscal responsibility to state government, creating new economic opportunities in every community, and shrinking longstanding inequities.",
        "Over the course of his Administration, Governor Murphy has delivered real tax fairness and relief for New Jersey’s middle class and seniors through a number of new tax cuts — including the most ambitious property tax relief program in the state’s history, the ANCHOR program — while ensuring that the wealthiest New Jerseyans and biggest corporations pay their fair share.",
        "A major hallmark of the Murphy Administration has been revitalizing New Jersey’s reputation as a global leader in innovation. In pursuit of this goal, Governor Murphy has introduced a new set of economic incentives focused on promoting the growth of local businesses and innovative startups, enacted the state’s first tax credits for historic preservation, and expanded credits for brownfields reclamation and redevelopment, among other initiatives designed to put New Jerseyans at the forefront of tomorrow’s economy.",
        "The Governor has prioritized cultivating the most diverse and inclusive innovation ecosystem in the nation by supporting the growth of New Jersey-based start-ups and innovators through initiatives like the New Jersey Innovation Evergreen Fund and New Jersey’s AI Moonshot, which he announced during his 2024 State of the State Address. He also launched the Strategic Innovation Centers program, which has supported major incubators and accelerators across the state in a wide variety of industries, from the life sciences to fintech. Thanks to these efforts, New Jersey is now one of the top states in the nation for venture capital investment and has been recognized as the most-improved state for business, according to CNBC.",
        "Governor Murphy has also positioned New Jersey to lead the world in combating climate change, particularly through the state’s growing dominance in clean energy industries like solar power and offshore wind. As part of these efforts, he has set New Jersey on a course to reach 100% clean energy by 2035, which represents one of the most ambitious clean energy goals in the entire country. And through clean energy supply chain projects at the Paulsboro Marine Terminal, and by creating the nation’s first purpose built offshore wind port at the South Jersey Wind Port in Salem County, the state is poised to create generations of good-paying, union jobs in the renewable industries that will power America’s future.",
        "The Governor has also focused on making New Jersey a leading location for film, television, and digital production, enacting a new incentive program that has attracted billions of dollars in investments to New Jersey since 2021. And he has established New Jersey as a premier destination for live entertainment and sports. During Governor Murphy’s time in office, the state has been selected to host some of the world’s biggest sporting events, including the 2025 FIFA Club World Cup Final and the 2026 FIFA World Cup Final.",
        "Additionally, when New Jersey was the epicenter of the COVID-19 pandemic, Governor Murphy worked closely with federal leaders, in Congress as well as the White House, to secure life-saving resources and make New Jersey a national leader in vaccine distribution and administration. Because of these efforts, New Jersey emerged from the pandemic as the number one state for private sector job creation in the entire Northeast. This historic economic rebound was supported by the billions of dollars that the Murphy Administration provided in state and federal relief to small businesses, schools, homeowners, tenants, landlords, and middle-class families.",
        "The Murphy Administration has also made monumental progress when it comes to lowering costs and raising wages for New Jersey’s working families. In partnership with the State Legislature, he raised the state’s minimum wage from $8.60 when he took office to more than $15-per-hour, enacted guaranteed paid sick leave, and expanded paid family leave. Governor Murphy has made historic investments into K-12 education, put New Jersey on the path to universal pre-K, and created the College Promise program to provide tuition-free college for tens of thousands of students.",
        "He has supported policies that have driven down the cost of health care, including prescription drugs, and has eliminated hundreds of millions of dollars in medical debt relief for New Jersey’s residents. And he worked closely with the Legislature to enact the most significant affordable housing law in 40 years, ensuring that new housing will be built fairly, equitably, and without delay.",
        "Moreover, the Murphy Administration has made generational investments modernizing New Jersey’s infrastructure, from creating new, dedicated funding streams to support NJ TRANSIT to securing full funding to complete the Gateway Program, which will double transit capacity along the Northeast Corridor.",
        "Governor Murphy has expanded protections for the state’s immigrant and LGBTQIA+ communities. He has made New Jersey a national leader in enacting gun safety laws that have resulted in the number of shootings in New Jersey falling to their lowest levels on record. And, in anticipation of the U.S. Supreme Court’s disastrous overturning of Roe v. Wade, he enacted a landmark law that protects the fundamental right to an abortion throughout pregnancy and has made New Jersey a safe haven for reproductive care.",
        "Since day one of his Administration, Governor Murphy has worked to establish New Jersey as a model state for social and racial justice by decriminalizing marijuana and cultivating a thriving adult-use cannabis industry, expunging the records of numerous non-violent offenders, and launching a first-of-its-kind clemency program for New Jerseyans in need of second chances. He has created the nation’s strongest provisions for environmental justice and has put a focus on eliminating stigma and promoting a compassionate approach to tackling opioid misuse. He has consistently protected and strengthened New Jersey’s democracy, including enacting automatic voter registration, in-person early voting, and restoring voting rights to individuals on probation or parole. And Governor Murphy has successfully appointed five Justices to the New Jersey Supreme Court, all with bipartisan support.",
        "While establishing New Jersey as a progressive leader in every area of public policy, Governor Murphy has also made historic progress in restoring New Jersey’s financial health. He became the first Governor in a quarter-century to make a full annual pension payment, which he has now done for four years in a row. Additionally, after 11 credit rating downgrades under the prior administration, Governor Murphy has secured seven credit rating upgrades for New Jersey. Under his leadership, New Jersey has seen record budget surpluses and the retirement of billions of dollars in state debt.",
        "Governor Murphy currently serves as the Finance Chair of the Democratic Governors Association. Previously, he served as the Chair of the National Governors Association and the Democratic Governors Association, and made history as the first Governor to lead both organizations simultaneously.",
        "The youngest of four children of the late Walter F. Murphy, Sr. and Dorothy Murphy, Governor Murphy was born in Boston, Massachusetts on August 16, 1957, and was raised in both Newton and nearby Needham, Massachusetts.",
        "The Governor is a graduate of Needham High School, Harvard University, and The Wharton School of the University of Pennsylvania. He has been awarded numerous honorary degrees.",
        "Governor Murphy and his wife, Tammy Snyder Murphy, reside in Middletown, located in Monmouth County, and are the parents of four adult children: Josh, Emma, Charlie, and Sam."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/GovMurphy_April2023.jpg",
      "photoLocalPath": "governors/nj-phil-murphy.jpg"
    }
  },
  {
    "state": "New Mexico",
    "stateId": "NM",
    "sourceUrl": "https://www.nga.org/governors/new-mexico/",
    "scrapedAt": "2025-12-27T20:13:53.644Z",
    "governor": {
      "name": "Michelle Lujan Grisham",
      "party": "Democratic",
      "terms": [
        "January 1, 2019 - January 1, 2023",
        "January 1, 2023 - Current"
      ],
      "born": "October 24, 1959",
      "birthState": "New Mexico",
      "school": "University of New Mexico",
      "spouse": null,
      "contact": {
        "address": "490 Old Santa Fe Trail Room 400\nSanta Fe, NM 87501",
        "phone": "505-476-2200"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://www.governor.state.nm.us/"
        },
        {
          "label": "State Website",
          "url": "http://www.newmexico.gov/"
        }
      ],
      "about": [
        "Michelle Lujan Grisham is the thirty-second governor of the state of New Mexico, the first Democratic Latina to be elected governor in U.S. history.",
        "As governor, Lujan Grisham has implemented a series of evidence-based policies aimed at transforming New Mexico’s public education system, expanding the state’s economy to include more high-quality employment opportunities and preserving New Mexico’s air, land and water. In 2019, she oversaw one of the most productive legislative sessions in state history, signing a broad package of bipartisan bills into law, notably a historic investment in public education and a landmark transition to clean energy.",
        "A longtime state Cabinet secretary at both the New Mexico Department of Aging and Long-term Services and Department of Health, Lujan Grisham has been a leading advocate for senior citizens, veterans and the disabled as well as investments in health care infrastructure and innovative programming that has improved access and quality of care for New Mexicans across the state.",
        "She was elected to the U.S. Congress in 2011, serving three terms in Washington on behalf of New Mexico’s 1st Congressional District. As a member of Congress, she worked aggressively to support local tribes, equal pay for women, public schools, public lands and veterans’ health care; she also advocated strongly for saving and creating clean New Mexico jobs. As chair of the Congressional Hispanic Caucus, she became a vocal, national leader in the battle against reactionary federal anti-immigrant policies.",
        "Driven by a deep compassion for seniors and those living with disabilities, and with experience as a caregiver herself, Lujan Grisham introduced and led the push for Care Corps, an innovative caregiving initiative that places volunteers in communities to provide non-medical services to seniors and individuals with disabilities. With this support, people can continue to live independently in their homes and communities.",
        "Lujan Grisham was born in Los Alamos and graduated from St. Michael’s High School in Santa Fe before earning undergraduate and law degrees from the University of New Mexico. A 12th-generation New Mexican, she is the mother of two adult children and grandmother of three."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/02/New-Mexico-Michelle-Lujan-Grisham-January-2018.jpg",
      "photoLocalPath": "governors/nm-michelle-lujan-grisham.jpg"
    }
  },
  {
    "state": "New York",
    "stateId": "NY",
    "sourceUrl": "https://www.nga.org/governors/new-york/",
    "scrapedAt": "2025-12-27T20:13:55.489Z",
    "governor": {
      "name": "Kathy Hochul",
      "party": "Democratic",
      "terms": [
        "August 24, 2021 - January 1, 2023",
        "January 1, 2023 - Current"
      ],
      "born": "August 27, 1958",
      "birthState": "New York",
      "school": null,
      "spouse": "William J. Hochul Jr.",
      "contact": {
        "address": "NYS State Capitol Building\nAlbany, NY 12224",
        "phone": "518-474-8390"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.governor.ny.gov/"
        },
        {
          "label": "State Website",
          "url": "https://www.ny.gov/"
        }
      ],
      "about": [
        "Kathy Hochul is the 57th and first female Governor of New York State.\nShe began her career in public service on her local Town Board, before serving as Erie County Clerk and as a Member of Congress for New York’s 26th Congressional District.",
        "As Lieutenant Governor, she chaired the statewide Regional Economic Development Councils, and served as co-chair of the State’s Heroin and Opioid Task Force, Women’s Suffrage Commission, and Child Care Availability Task Force.",
        "Since being sworn into office in 2021, Governor Hochul has led by establishing a bold vision for New York’s future. Governor Hochul has spearheaded comprehensive policies and initiatives to help New Yorkers and their families, while building an economy that is stronger and more inclusive than before. Governor Hochul is making historic investments in the people, places, and things to make that happen – from healthcare workers, small businesses, and working families to infrastructure, education, and workforce development. And in the wake of the U.S. Supreme Court’s reckless decisions to strip away abortion rights and strike down commonsense gun regulations, Governor Hochul led the charge in Albany to protect reproductive health care and strengthen gun safety laws, ensuring New York continues to stand as a beacon of hope and freedom for the rest of the nation.",
        "Governor Hochul was born and raised in Western New York. She and her husband, Bill Hochul, are the proud parents of two children and one granddaughter."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2021/08/GovernorHochul.jpg",
      "photoLocalPath": "governors/ny-kathy-hochul.jpg"
    }
  },
  {
    "state": "North Carolina",
    "stateId": "NC",
    "sourceUrl": "https://www.nga.org/governors/north-carolina/",
    "scrapedAt": "2025-12-27T20:13:56.841Z",
    "governor": {
      "name": "Josh Stein",
      "party": "Democratic",
      "terms": [
        "January 1, 2025 - Current"
      ],
      "born": "September 13, 1966",
      "birthState": "Washington, D.C.",
      "school": "Dartmouth College (BA); Harvard University (MPP, JD)",
      "spouse": "Anna Stein",
      "contact": {
        "office of the governor": "20301 Mail Service Center\nRaleigh, NC 27699-0301",
        "phone": "919-814-2000"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.nc.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.ncgov.com/"
        }
      ],
      "about": [
        "Governor Josh Stein was called to public service by his faith and his family. His faith teaches him that we are all called to make a difference, and his parents Adam and Jane raised his brother Eric, sister Gerda, and him to try to do what is right. They grounded him in our shared values of freedom and opportunity for everyone.",
        "As Governor, Stein’s focus is on creating a safer, stronger North Carolina. He will bring people together to help western North Carolina recover from Hurricane Helene, create economic opportunity for all North Carolinians, invest in public schools, and keep people safe.",
        "Stein spent the past eight years serving as North Carolina’s Attorney General. During that time, he and his team worked to clear the nation’s largest backlog of untested rape kits and hold accountable the big drug companies that created and fueled the opioid crisis, securing more than $50 billion in settlement funds, including nearly $1.5 billion for North Carolina to help people struggling with addiction. They held e-cigarette manufacturer Juul accountable for sparking a teen vaping epidemic – the first state in the country to do so – and protected vulnerable North Carolinians from fraudsters and scammers, including going after companies that price-gouged customers in the wake of natural disasters. Stein advocated for fully funding North Carolina’s public schools through the Leandro Plan and defended people’s right to vote and women’s right to choose.",
        "Before his time as Attorney General, Stein served in the state Senate and was a champion for public education, clean energy, and public safety. Between 2001 and 2008, he served as senior deputy attorney general for consumer protection in the North Carolina Department of Justice, where he helped run the payday lenders charging loan shark interest rates out of the state and helped enhance people’s privacy protections.",
        "Stein earned law and public policy degrees from Harvard University and graduated from Dartmouth College and Chapel Hill High School. After college, he taught high school English and economics in Zimbabwe for two years. As a young lawyer, Stein worked with the Self-Help Credit Union to develop affordable single-family homes in Durham and with the North Carolina Minority Support Center to raise capital to invest in small businesses across North Carolina.",
        "Josh and his wife Anna live in Raleigh and are members of Temple Beth Or. They are the proud parents of Sam, Adam, and Leah, who all attended North Carolina public schools, just like they did."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Josh-Stein_NC.jpg",
      "photoLocalPath": "governors/nc-josh-stein.jpg"
    }
  },
  {
    "state": "North Dakota",
    "stateId": "ND",
    "sourceUrl": "https://www.nga.org/governors/north-dakota/",
    "scrapedAt": "2025-12-27T20:13:58.539Z",
    "governor": {
      "name": "Kelly Armstrong",
      "party": "Republican",
      "terms": [
        "December 15, 2024 - Current"
      ],
      "born": "October 8, 1976",
      "birthState": "North Dakota",
      "school": "University of North Dakota",
      "spouse": "Kjersti Armstrong",
      "contact": {
        "address": "600 East Boulevard Avenue\nBismarck ND, 58505-0001",
        "phone": "701-328-2200"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.governor.nd.gov/"
        },
        {
          "label": "State Website",
          "url": "https://nd.gov/"
        }
      ],
      "about": [
        "Kelly Armstrong took office as the 34th governor of North Dakota on Dec. 15, 2024 and brings a background in business, a love for the outdoors and a passion for volunteering and public service to the Governor’s Office.",
        "Kelly is a lifelong, devoted North Dakotan and a tireless advocate for making North Dakota a better place to live, work, and raise a family.",
        "Kelly was elected to the U.S. House of Representative in 2018, representing North Dakota’s at-large congressional district. During his tenure, Armstrong was an advocate for energy independence, agricultural interests and conservative fiscal policies, reflecting the priorities of his largely rural and resource-rich home state.",
        "A staunch supporter of North Dakota’s oil and gas industries, Armstrong worked to advance legislation aimed at reducing regulatory burdens and promoting domestic energy production. He has also championed policies to support farmers and ranchers, advocating for fair trade agreements and federal assistance during economic challenges.",
        "In Congress, Armstrong was an active member of the House Judiciary Committee and the House Energy and Commerce Committee.",
        "Prior to his congressional career, Kelly served in the North Dakota Senate from 2012 to 2019 representing District 36. He spearheaded legislation to reform DUI laws and pass a $2 billion statewide investment into our infrastructure. Kelly was elected Chairman of the North Dakota Republican Party in 2015 and led the party to landslide victories for President Donald Trump, Gov. Doug Burgum, and ND Legislative Majorities. His legal background as an attorney has influenced his legislative priorities and contributions to legal and regulatory debates.",
        "Kelly grew up in Dickinson, he earned his bachelor’s degree from the University of North Dakota and received his law degree in 2003 from UND as well.",
        "Kelly married his wife Kjersti in 2004 and they have two children, Anna and Eli."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2024/12/GovernorArmstrong.jpg",
      "photoLocalPath": "governors/nd-kelly-armstrong.jpg"
    }
  },
  {
    "state": "Northern Mariana Islands",
    "stateId": "MP",
    "sourceUrl": "https://www.nga.org/governors/northern-mariana-islands/",
    "scrapedAt": "2025-12-27T20:14:00.045Z",
    "governor": {
      "name": "David M. Apatang",
      "party": "Republican",
      "terms": [
        "July 24, 2025 - Current"
      ],
      "born": "July 10, 1948",
      "birthState": "Guam",
      "school": null,
      "spouse": null,
      "contact": {
        "address": "Juan A. Sablan Memorial Building\nCapitol Hill 96950 Saipan\nNorthern Mariana Islands",
        "phone": "670-237-2200"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.cnmi.gov/"
        }
      ],
      "about": [
        "The Honorable David M. Apatang is the 11th Governor of the Commonwealth of the Northern Mariana Islands, serving alongside Lt. Governor Dennis Mendiola since July 2025.",
        "He previously served as the 13th Lt. Governor of the Commonwealth of the Northern Mariana Islands, serving alongside Governor Arnold I. Palacios from January 2023 – July 2025.",
        "Prior to his time as Lt. Governor, he served as the Mayor of Saipan from January 2015 to January 2023. He served three terms in the Northern Marianas Commonwealth Legislature from January 1999 to January 2011 and served as a member of the Saipan, Northern Islands Municipal Council of the Northern Marianas Commonwealth from January 1997 to January 1999.",
        "Governor Apatang also served as the Chief of Procurement and Supply, as well as the acting Director of Finance and Accounting with the Department of Finance from June 1987 to January 1996. He also served as the State Director of the U.S. Selective Service System from 1990 to 1996.",
        "Prior to his career as a public servant with the CNMI, Governor Apatang retired from the United States Army as a First Sergeant after a 20-year career as recruiter, platoon sergeant, operations officer, station commander, drill sergeant, and Equal Opportunity NCO.",
        "Born on July 10, 1948, Governor Apatang was born on Guam and attended George Washington High School. He and his wife, Antonia Pangelinan Mafnas Apatang, who passed away in 2016, were blessed with five children: Elaine, Kimberly, Victoria, Deyna, and David John, and 15 grandchildren: David Peter, John Anthony, Justin, Jackie, Kevin, Kelly, John David, Donovan, Devon, Alaina, Andrew, Lana, Kyu, David, and Charles."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/07/David-M-Apatang-Head-Shot.jpg",
      "photoLocalPath": "governors/mp-david-m-apatang.jpg"
    }
  },
  {
    "state": "Ohio",
    "stateId": "OH",
    "sourceUrl": "https://www.nga.org/governors/ohio/",
    "scrapedAt": "2025-12-27T20:14:01.608Z",
    "governor": {
      "name": "Mike DeWine",
      "party": "Republican",
      "terms": [
        "January 14, 2019 - January 8, 2023",
        "January 8, 2023 - Current"
      ],
      "born": "January 5, 1947",
      "birthState": "Ohio",
      "school": "Miami University, Ohio Northern University",
      "spouse": "Fran DeWine",
      "contact": {
        "address": "Riffe Center, 30th Floor\n77 South High Street\nColumbus, OH 43215",
        "phone": "614-644-4357"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.ohio.gov/"
        },
        {
          "label": "State Website",
          "url": "http://ohio.gov/"
        }
      ],
      "about": [
        "Mike DeWine’s story is a true Ohio story. Raised in Yellow Springs, Ohio, Mike DeWine and Fran (Struewing) met in the first grade and married while students at Miami University. They’ve been blessed with eight children, 28 grandchildren, and one great-grandchild. Family is at the core of everything Mike DeWine does, and that’s why he has devoted his life to fighting for Ohio’s families. He knows when families are strong, Ohio communities are stronger, and our future is bright.",
        "Mike DeWine’s family started a seed company in Yellow Springs. Working alongside his parents and grandparents, Mike learned early the value of hard work, strong leadership, and fiscal responsibility. Growing up, he loaded seed bags onto trucks and boxcars, shoveled wheat out of trucks during harvest, worked in wheat fields to help ensure the purity of the seed, and basically did whatever it took to get the job done for their customers. Inseparable to the end, his parents were married for 65 years and died within four days of each other. The values he learned from them still live within him today.",
        "On November 6, 2018, Mike DeWine was elected to serve as the 70th Governor of the State of Ohio. The Governor has had a long and distinguished career in public service, focusing on protecting Ohio children and families. He was previously the 50th Attorney General of Ohio and has previously been elected to serve as Greene County Prosecutor, Ohio State Senator, U.S. Congressman, Ohio Lt. Governor, U.S. Senator."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/01/Gov-Mike-DeWine.jpg",
      "photoLocalPath": "governors/oh-mike-dewine.jpg"
    }
  },
  {
    "state": "Oklahoma",
    "stateId": "OK",
    "sourceUrl": "https://www.nga.org/governors/oklahoma/",
    "scrapedAt": "2025-12-27T20:14:03.812Z",
    "governor": {
      "name": "Kevin Stitt",
      "party": "Republican",
      "terms": [
        "January 14, 2019 - January 9, 2023",
        "January 9, 2023 - Current"
      ],
      "born": "December 28, 1972",
      "birthState": "Florida",
      "school": "Oklahoma State University",
      "spouse": "Sarah Stitt",
      "contact": {
        "address": "2300 N. Lincoln Blvd.\nSuite 212\nOklahoma City, OK 73105",
        "phone": "405-521-2342"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://www.gov.ok.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.state.ok.us/"
        }
      ],
      "about": [
        "Governor Kevin Stitt is leading Oklahoma with a vision to become Top Ten in job growth, infrastructure, education and more.",
        "He is an entrepreneur who founded Gateway in Tulsa, Oklahoma, in 2000. Starting with only $1,000 and a computer, he grew Gateway into a nationwide mortgage company operating in 42 states and servicing more than $20 billion in residential mortgages. In 2018, he led Gateway through a merger and established Gateway First Bank, which today is one of Oklahoma’s 10 largest banks by assets with over $2 billion in assets, 166 mortgage centers across the U.S., and more than 1,600 employees.",
        "Oklahomans spoke in record numbers that they wanted Stitt to use his business acumen to transform the state. In 2018, he received more votes than any gubernatorial candidate in state history in his first bid for elected office of any kind.",
        "Governor Stitt has taken a groundbreaking approach to his administration by appointing the most female cabinet secretaries in state history and tapping expert advisors from the private sector, including the first chief operating officer in state history.",
        "He is committed to delivering taxpayers more for their money, and his fiscally conservative leadership helped the state build its largest savings account in history, which proved to be prophetic in the face of an oil and gas downturn.",
        "Stitt is a fourth-generation Oklahoman and a graduate of Oklahoma State University. He and his wife, Sarah, have been married for 25 years and they have six children.",
        "The Governor is the current Chair of the National Governors Association."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/06/Oklahoma-Kevin-Stitt-June-2019.jpg",
      "photoLocalPath": "governors/ok-kevin-stitt.jpg"
    }
  },
  {
    "state": "Oregon",
    "stateId": "OR",
    "sourceUrl": "https://www.nga.org/governors/oregon/",
    "scrapedAt": "2025-12-27T20:14:05.369Z",
    "governor": {
      "name": "Tina Kotek",
      "party": "Democratic",
      "terms": [
        "January 9, 2023 - Current"
      ],
      "born": "September 30, 1966",
      "birthState": "Pennsylvania",
      "school": "University of Oregon, University of Washington",
      "spouse": "Aimee Kotek Wilson",
      "contact": {
        "address": "900 Court Street\nSuite 254\nSalem, OR 97301-4047",
        "phone": "503-378-4582"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://www.oregon.gov/gov/pages/index.aspx"
        },
        {
          "label": "State Website",
          "url": "http://www.oregon.gov/"
        }
      ],
      "about": [
        "On November 8, 2022, Tina Kotek made history along with Maura Healey of Massachusetts, becoming the first openly lesbian governors elected in American history.",
        "Throughout Tina’s professional career as an advocate for those in need, she has carried the value of service instilled in her by her parents to get real results for Oregonians.",
        "Tina’s grandparents came from Eastern Europe in the early part of the last century to find opportunity and a better life. Her parents were proud first-generation Americans. They believed in hard work, being informed citizens, and encouraging their children to follow their dreams.",
        "Tina moved to Oregon from the East Coast in 1987, and fell in love with the beauty of the state and the openness of the people. She finished her undergraduate degree at the University of Oregon, graduating without student debt because of a Pell grant, work study assistance, and affordable tuition.",
        "Tina came out as a lesbian in her early twenties. While it wasn’t always easy, each experience coming out to others strengthened her resilience. While getting her graduate degree, Tina fought for and won domestic partnership rights for faculty and students at the University of Washington.",
        "When Tina returned to Oregon after graduation, she took a job at Oregon Food Bank, attracted to their mission to end hunger, not just feed people. As a person of faith with a belief in the inherent value of everyone, she knew she had found her calling as an advocate for others. Tina continued her advocacy for children when she joined Children First for Oregon as their policy director.",
        "Tina’s experience working at nonprofits on behalf of Oregon’s most vulnerable led her to run for public office and serve in the Oregon Legislature. In her first term, she rewrote the state’s poverty program for low-income families while also playing a key role in making historic progress for the LGBTQ+ community by passing statewide protections and access to benefits.",
        "In 2013, Tina was honored to be elected by her peers to be the Speaker of the House — becoming the nation’s first openly lesbian House Speaker. In nearly a decade leading the Oregon House, she worked tirelessly to expand economic security for more families, combat climate change, and help Oregonians navigate an unprecedented pandemic. In 2022, she made history again, joining Maura Healey of Massachusetts in becoming the first openly lesbian governors elected in American history.",
        "As Governor, Tina will be a leader who puts people first, who prioritizes justice and equity, who brings people together, and who inspires all of us to reach for a better future.",
        "Governor Kotek and her wife Aimee Kotek Wilson, a social worker, have been together for 19 years and have one dog."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/GTK_Headshot_square_resized.jpg",
      "photoLocalPath": "governors/or-tina-kotek.jpg"
    }
  },
  {
    "state": "Pennsylvania",
    "stateId": "PA",
    "sourceUrl": "https://www.nga.org/governors/pennsylvania/",
    "scrapedAt": "2025-12-27T20:14:07.060Z",
    "governor": {
      "name": "Josh Shapiro",
      "party": "Democratic",
      "terms": [
        "January 17, 2023 - Current"
      ],
      "born": "June 20, 1973",
      "birthState": "Missouri",
      "school": "University of Rochester, Georgetown University Law Center",
      "spouse": "Lori Shapiro",
      "contact": {
        "address": "501 North 3rd Street\n508 Main Capitol Building\nHarrisburg, PA 17120",
        "phone": "717-787-2500"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.pa.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.pa.gov/"
        }
      ],
      "about": [
        "Josh Shapiro is the 48th Governor of the Commonwealth of Pennsylvania.",
        "Since being sworn in to the Office of Governor in January 2023, Governor Shapiro has brought people together to get stuff done and defend Pennsylvanians’ fundamental freedoms. In his first 18 months in office, despite working with the only politically divided legislature in the nation, Governor Shapiro has hit the ground running and delivered meaningful results for the people of Pennsylvania.",
        "Governor Shapiro believes all Pennsylvanians should have the freedom to chart their own course and the opportunity to succeed, and the actions he’s taken in his first year and a half have been rooted in that promise. He signed an executive order on his first day in office announcing that 92 percent of state government jobs are open to people without a college degree – because in Pennsylvania, we value what skills and experience someone brings to the job, not arbitrary requirements. The first bill he signed into law was bipartisan legislation to require insurers to cover preventive breast and ovarian cancer screenings for high-risk women at no cost.",
        "The Governor has made clear his commitment to invest in quality schools, safe communities, and an economy that works for all. Under his leadership, he brought Democrats and Republicans together to invest more in public education than ever before, hire hundreds of new State Police troopers, and invest millions in economic development to create jobs in communities too often forgotten and left behind.",
        "Now, when children in Pennsylvania go to school, they can get free breakfast and there are more mental health counselors and resources available when they need them. When those students graduate from high school, they have more opportunities to chart their own course – whether in the workforce, through an apprenticeship program, or at college – and their communities are safer and more prosperous.",
        "He’s consistently trying to make government work more effectively and efficiently – and ensure there’s no wrong door for Pennsylvanians who need to access their state government. That led him to implement automatic voter registration and develop the Commonwealth’s first ever in-house digital services team – CODE PA – to develop better tools for government officials and the public alike. He reformed the permitting process, eliminated backlogs, and showed his GSD attitude when he put together the team that reopened I-95 in just 12 days after a portion of the highway collapsed and the experts said it would take months to repair.",
        "Governor Shapiro is investing in the people of Pennsylvania, but he also understands that in creating opportunity, people shouldn’t be defined by their worst day. That’s why he delivered on his promise to reform the criminal justice system, ensuring probation serves as a tool to help Pennsylvanians re-enter their communities and paving the way for more Pennsylvanians to get the second chances they deserve.",
        "As Governor, he has made it a priority to represent all Pennsylvanians, traveling to communities all across the Commonwealth and meeting Pennsylvanians from all walks of life.",
        "Through it all, Governor Shapiro continues – as he’s done throughout his career – to take on big fights, bring people together to get stuff done, and defend Pennsylvanians’ rights and freedoms.",
        "As Governor, he’s built on his work as Attorney General, when he successfully defended the right to vote, protected reproductive freedom, held powerful corporations – like opioid manufacturers – accountable, and oversaw the groundbreaking investigation of sexual abuse into the Catholic Church.",
        "He served as Attorney General from 2017 to 2023, Chair of the Board of Commissioners in Montgomery County from 2011 to 2017, and State Representative from 2005 to 2011.",
        "Governor Shapiro grew up in Pennsylvania, watching his parents serve their community – his father is a pediatrician and served our nation in the navy, and his mother is a retired educator. Their example and his faith inspired him to enter into public service.",
        "Governor Shapiro is married to his high-school sweetheart, Lori. She is proud to serve the Commonwealth as its First Lady and is doing meaningful work with nonprofits and volunteer organizations all across this Commonwealth. They are the proud parents of four children: Sophia (22), Jonah (19), Max (15), and Reuben (13)."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2023/01/JDS_headshot.png",
      "photoLocalPath": "governors/pa-josh-shapiro.png"
    }
  },
  {
    "state": "Puerto Rico",
    "stateId": "PR",
    "sourceUrl": "https://www.nga.org/governors/puerto-rico/",
    "scrapedAt": "2025-12-27T20:14:08.574Z",
    "governor": {
      "name": "Jenniffer González-Colón",
      "party": "Republican",
      "terms": [
        "January 2, 2025 - Current"
      ],
      "born": "August 5, 1976",
      "birthState": "Puerto Rico",
      "school": "University of Puerto Rico, Río Piedras (BA); Interamerican University of Puerto Rico (JD, LLM)",
      "spouse": null,
      "contact": {},
      "links": [
        {
          "label": "Website",
          "url": "https://www.fortaleza.pr.gov/"
        }
      ],
      "about": [
        "Jenniffer González-Colón was elected Governor on November 5, 2024.  Prior to this election González-Colón served as Puerto Rico’s sole Representative to the U.S. Congress, known as Resident Commissioner, and was the first woman to hold the office. A lifelong Republican advocate for Puerto Rico statehood, González-Colón began her political journey in a special election in 2002, becoming the youngest member ever elected to the Puerto Rico House of Representatives. She quickly ascended through the ranks, serving as Speaker of the House for four years and later as Minority Leader for an additional four years.",
        "Her priorities as Puerto Rico’s voice in Congress included spearheading the economic recovery of the Island, securing equal treatment for Puerto Rico’s 3.2 million American citizens in federal laws, regulations, services, and funding, and ensuring that Congress responds decisively to the overwhelming mandate of Puerto Rico’s voters for admission as the 51st state of the Union as reflected by clear majorities through locally-held plebiscites in 2012, 2017, 2020, and 2024.",
        "Puerto Rico suffered its worst natural disaster in 90 years after hurricanes Irma and Maria devastated the Island in 2017. González-Colón’s efforts to keep Puerto Rico’s recovery at the forefront of Congress’ attention, organizing visits of members of Congress and administration officials, building bipartisan alliances, have resulted in over $117 billion in appropriations after the disaster, as well as legislation allowing infrastructure to be rebuilt to improved standards, full federal share in funding for rebuilding, and an extension in the emergency agencies’ mandates. Her contributions have been acknowledged through various honors, including being named one of the 100 most influential Republican women by NewsMax and consistently ranking among the top 20 in the Bipartisan Index rankings compiled by the Lugar Center and Georgetown University.",
        "A product of the Puerto Rico public schools, holder of a Juris Doctor and Master of Laws degree (LL.M.), González-Colón served as Chair of the Puerto Rico Republican Party from 2015 to 2021, and First Vice Chair of the local pro-statehood party, Partido Nuevo Progresista."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Governor_Jenniffer_Gonzalez-scaled.jpg",
      "photoLocalPath": "governors/pr-jenniffer-gonza-lez-colo-n.jpg"
    }
  },
  {
    "state": "Rhode Island",
    "stateId": "RI",
    "sourceUrl": "https://www.nga.org/governors/rhode-island/",
    "scrapedAt": "2025-12-27T20:14:10.133Z",
    "governor": {
      "name": "Dan McKee",
      "party": "Democratic",
      "terms": [
        "March 2, 2021 - January 3, 2023",
        "January 3, 2023 - Current"
      ],
      "born": "June 16, 1951",
      "birthState": "Rhode Island",
      "school": "Assumption College, Harvard University",
      "spouse": "Susan McKee",
      "contact": {
        "address": "82 Smith Street\nProvidence, RI 02903",
        "phone": "401-222-2080"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.ri.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.ri.gov/"
        }
      ],
      "about": [
        "Dan McKee is a lifelong Rhode Islander who proudly serves as the Ocean State’s 76th Governor. He began his career in public service on the Town Council in his hometown of Cumberland. After serving for eight years, he was elected Mayor. Following 12 years as Mayor of Cumberland, he left office in 2014 when he was elected Lieutenant Governor. He ascended to the Governor’s Office in 2021 and was re-elected to his first full term in office in 2022.",
        "When Dan became Governor in March 2021, it was amidst the most challenging global pandemic in more than a century. Despite that, he delivered one of the nation’s best vaccine rollouts, getting shots in arms at rates that were among the very best in the country. His leadership also helped to rebuild Rhode Island’s struggling economy, bringing the state’s unemployment to its lowest ever on record. As Governor, he continues to focus on the same issues he has cared about his whole career – accessible government, effective fiscal management, a high-quality public education for all students, equity and justice, and economic development centered on small businesses.",
        "Elected Lieutenant Governor in 2014, he used the office to stand up for working Rhode Islanders and support small businesses. Together with 26 mayors, Dan sued Big Pharma to hold them accountable for their role in the opiate crisis. He took on the giant electric companies and lowered costs for ratepayers. When the COVID-19 pandemic hit, Dan organized a grassroots small business movement ensuring millions of dollars in federal C.A.R.E.S. Act funds were allocated to support the small business community.",
        "Born in Cumberland, Dan is the son of James and Helen Willa McKee. His parents taught him the importance of working hard and giving back to the community. In particular, Dan is still inspired by his father’s role in starting the local Boys & Girls Club in their town.",
        "Dan graduated from Cumberland High School, where he played basketball and met his wife Susan. He holds a bachelor’s degree in political science and education from Assumption College. He earned a master’s degree in public administration from Harvard University’s Kennedy School of Government. He has owned and operated successful small businesses in the Blackstone Valley for three decades.",
        "Dan and Susan have two children, Matthew and Kara. Matthew is married to Laura (Clifford) McKee. Both Matthew and Kara went to public school in Cumberland where they followed in their father’s footsteps and starred on the basketball team. For many years, Dan was a youth basketball coach, where he mentored young athletes and won two AAU state championships."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2021/03/Gov-Dan-Mckee-400.png",
      "photoLocalPath": "governors/ri-dan-mckee.png"
    }
  },
  {
    "state": "South Carolina",
    "stateId": "SC",
    "sourceUrl": "https://www.nga.org/governors/south-carolina/",
    "scrapedAt": "2025-12-27T20:14:12.042Z",
    "governor": {
      "name": "Henry McMaster",
      "party": "Republican",
      "terms": [
        "January 24, 2017 - January 8, 2019",
        "January 8, 2019 - January 11, 2023",
        "January 11, 2023 - Current"
      ],
      "born": "May 27, 1947",
      "birthState": "South Carolina",
      "school": "University of South Carolina",
      "spouse": "Peggy McMaster",
      "contact": {
        "address": "State House\n1100 Gervais Street\nColumbia, South Carolina 29201",
        "phone": "803-734-2100"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.sc.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.sc.gov/"
        }
      ],
      "about": [
        "Governor Henry Dargan McMaster, a longtime public servant of South Carolina, was born May 27, 1947, in Columbia, South Carolina. He received a bachelor’s degree in history from the University of South Carolina in 1969 and as an undergraduate was a member of Kappa Alpha Order and the South Carolina Student Legislature.",
        "In 1973, he graduated from the University of South Carolina School of Law, where he was on the editorial board of the South Carolina Law Review. Later that year, he was admitted to the Richland County Bar Association. He also served in the U.S. Army Reserves, receiving an honorable discharge in 1975. Upon graduation from law school, he was a legislative assistant to U.S. Senator Strom Thurmond in Washington, D.C., and joined the law firm of Tompkins and McMaster in 1974. He was later admitted to practice before the U.S. District Court, U.S. Court of Claims, the U.S. Court of Appeals for the Fourth Circuit, and the Supreme Court of the United States. Governor McMaster practiced law for over 40 years, as a federal and state prosecutor and in private practice in both state and federal courts. Governor McMaster was the first U.S. attorney appointed by President Ronald Reagan in 1981, and his “Operation Jackpot” investigation into international drug smuggling resulted in more than 100 convictions.",
        "In 1991, he was appointed to the state Commission on Higher Education and joined the Board of Directors of the nonprofit South Carolina Policy Council where he also served as chair. He chaired the state Republican Party from 1993 to 2002. He was elected attorney general of South Carolina in 2002 and reelected in 2006. As attorney general, Governor McMaster made prosecution of criminal domestic violence a priority and led a crackdown on child internet predators. He extended the South Carolina grand jury’s jurisdiction to environmental and gang crimes and broadened its authority to include securities crimes.",
        "Following service on the South Carolina Ports Authority Board of Directors, he was elected lieutenant governor in 2014. As lieutenant governor, he led efforts to protect our state’s growing senior citizen population with social, economic, and health support services, which earned national recognition from AARP. McMaster was sworn in as governor in January 2017 following then – Governor Nikki Haley’s appointment as United States Ambassador to the United Nations. He was elected to a full term as governor in November 2018 and re-elected in November 2022.",
        "Governor McMaster has led a strong and vibrant South Carolina economy, announcing more than 90,000 new jobs and over $39.1 billion in new capital investment in the state. Under his leadership, the state has made transformative investments in the classroom by expanding full day four-year-old kindergarten, raising K-12 teacher pay, and placing a school resource officer in every school. Colleges and universities are becoming more accessible and affordable due to the governor’s tuition freeze and by his doubling of funding for needs-based financial aid for in-state students.",
        "He has cut taxes on small businesses by $317 million and has returned over $1 billion dollars to the taxpayers. The governor has kept the commitment to our state’s military veterans, first responders, law enforcement, firefighters, and peace officers – through pay increases, retention bonuses, and exemptions on retirement income exemption.  The governor’s limited, measured, and temporary COVID-19 actions – coupled with freezing all new state government spending during the pandemic – allowed South Carolina’s economy not only to survive, but to actually thrive and generate record surpluses.",
        "Governor McMaster served on the Palmetto Health Foundation Board and is the recipient of the Order of the Palmetto, the state’s highest civilian honor awarded to citizens of South Carolina for extraordinary lifetime service and achievements of national and statewide significance. He was previously named Public Servant of the Year by the Sierra Club and National Law Enforcement Officer of the Year by the Humane Society of the United States.",
        "Governor McMaster and his wife, Peggy, have two adult children and two grandchildren."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/McMaster-Gov.-2025a-full-size_square-scaled.jpg",
      "photoLocalPath": "governors/sc-henry-mcmaster.jpg"
    }
  },
  {
    "state": "South Dakota",
    "stateId": "SD",
    "sourceUrl": "https://www.nga.org/governors/south-dakota/",
    "scrapedAt": "2025-12-27T20:14:13.277Z",
    "governor": {
      "name": "Larry Rhoden",
      "party": "Republican",
      "terms": [
        "January 25, 2025 - Current"
      ],
      "born": "February 5, 1959",
      "birthState": "South Dakota",
      "school": null,
      "spouse": "Sandra Rhoden",
      "contact": {
        "address": "500 East Capitol Avenue\nPierre, SD 57501",
        "phone": "605-773-3212"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.sd.gov/default.aspx"
        },
        {
          "label": "State Website",
          "url": "https://www.sd.gov/cs"
        }
      ],
      "about": [
        "Larry Rhoden is a lifelong West River rancher, a dedicated husband and father, and a proven leader with a record of service for South Dakota. He serves as the 34th Governor of South Dakota.",
        "Larry was elected as lieutenant governor alongside Governor Kristi Noem in 2018 and re-elected in 2022. He rose to the office of governor in January 2025.",
        "Growing up in the church, Larry understood true service at a young age. After graduating high school, he joined the South Dakota National Guard, serving six years and carrying on a family legacy of military service that began in the Revolutionary War. While his children were young, he served as a church trustee, earned a seat on the local school board, and led the Board of Directors for the area Cenex. He currently serves as a Deacon of his home church.",
        "In 2000, Larry was elected to the state legislature. During his time as a citizen legislator, his peers repeatedly selected him to serve in leadership, and he’s shown an aptitude for getting things done. Larry served as House Majority Leader and chaired both the Senate and House State Affairs Committees. Larry worked with then-Representative Noem to reform property taxes, led efforts to repeal the so-called “Trucker’s Tax,” and shaped legislation to defend the 2nd Amendment rights of South Dakotans. His work earned him the American Conservative Union’s highest ranking in 2017. He served as Interim Secretary of the South Dakota Department of Agriculture from May 2020 to September 2020 and as South Dakota’s Agriculture Ambassador from 2020 to 2025. He has also served as a past President of State Ag and Rural Leaders.",
        "Larry still does custom welding and operates the ranch where he was born and raised. He and his wife, Sandy, have four sons: Jesse, Cody, Reggie, and Tristen; daughters-in-law Sarah, Liz, Jennifer, and Kalen; and seven grandchildren."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Governor-Rhoden-square-scaled.jpg",
      "photoLocalPath": "governors/sd-larry-rhoden.jpg"
    }
  },
  {
    "state": "Tennessee",
    "stateId": "TN",
    "sourceUrl": "https://www.nga.org/governors/tennessee/",
    "scrapedAt": "2025-12-27T20:14:15.133Z",
    "governor": {
      "name": "Bill Lee",
      "party": "Republican",
      "terms": [
        "January 19, 2019 - Current"
      ],
      "born": "October 9, 1959",
      "birthState": "Tennessee",
      "school": "Auburn University",
      "spouse": "Maria Lee",
      "contact": {
        "address": "600 Dr. Martin L. King, Jr. Blvd.\nNashville, TN 37243",
        "phone": "615-741-2001"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.tn.gov/content/tn/governor.html"
        },
        {
          "label": "State Website",
          "url": "https://www.tn.gov/"
        }
      ],
      "about": [
        "Bill Lee is a seventh-generation Tennessean and the 50th Governor of Tennessee. He was raised in Franklin, where he still resides today with his wife, Maria, on his family’s farm. He’s the proud father of four adult children (Jessica, twin sons Jacob and Caleb, and Sarah Kate) and ten grandchildren.",
        "After attending Williamson County Schools, Governor Lee attended Auburn University, where he studied Mechanical Engineering. After graduation, he returned home to Franklin to join the family business his grandfather started in 1944, a comprehensive mechanical construction service company. He became president of Lee Company in 1992.",
        "Since becoming Governor in 2019, Governor Lee has focused on several priorities including a strong workforce, quality education, economic development, public safety, and supporting families, all with a particular focus on the accelerated transformation of rural Tennessee.",
        "Under his leadership, Tennessee now has the fastest-growing economy of all 50 states, with the lowest tax burden in the nation, top business climate and a strong workforce strategy that have created more than 170,000 jobs for Tennesseans and generated $32 billion in capital investment since 2019. Tennessee’s unmatched business climate and skilled workforce continue to attract record investment from companies such as Ford Motor Company and SK On, In-N-Out, LG Chem, Oracle, General Motors and more.",
        "Additionally, under Governor Lee’s leadership, Tennessee has passed the largest tax cut in state history, strengthened career and technical training, expanded school choice, prioritized a record $1 billion investment in public education and passed the largest teacher pay raise in Tennessee history.",
        "The governor and first lady are people of strong faith. They are active in numerous faith-based ministries, which have taken them all over the world to serve people in need, including to Africa, Haiti, Central America, and the Middle East."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/GBL_2022_square.jpg",
      "photoLocalPath": "governors/tn-bill-lee.jpg"
    }
  },
  {
    "state": "Texas",
    "stateId": "TX",
    "sourceUrl": "https://www.nga.org/governors/texas/",
    "scrapedAt": "2025-12-27T20:14:16.452Z",
    "governor": {
      "name": "Greg Abbott",
      "party": "Republican",
      "terms": [
        "January 20, 2015 - January 7, 2019",
        "January 8, 2019 - January 17, 2023",
        "January 17, 2023 - Current"
      ],
      "born": "November 13, 1957",
      "birthState": "Texas",
      "school": "University of Texas at Austin, Vanderbilt University Law School",
      "spouse": "Cecilia Abbott",
      "contact": {
        "address": "P.O. Box 12428 Austin, TX 78711",
        "phone": "512/463-2000"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://gov.texas.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.state.tx.us/"
        }
      ],
      "about": [
        "Greg Abbott is the 48th Governor of the State of Texas. Before his election in 2014, Greg Abbott was the 50th and longest-serving Attorney General of Texas, where he earned a national reputation for defending religious liberty and protecting Texas communities and children. He also previously served as a Justice on the Texas Supreme Court and as a State District Judge in Harris County.",
        "Governor Abbott was born in Wichita Falls and raised in Duncanville. After graduating from The University of Texas at Austin, he earned a law degree from Vanderbilt University Law School.",
        "Governor Abbott and his wife, Cecilia, a former teacher and principal, and the first Hispanic First Lady of Texas, were married in 1981. Their daughter, Audrey, is a recent college graduate."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2018/07/TX_Gov_Greg_Abbott.png",
      "photoLocalPath": "governors/tx-greg-abbott.png"
    }
  },
  {
    "state": "Utah",
    "stateId": "UT",
    "sourceUrl": "https://www.nga.org/governors/utah/",
    "scrapedAt": "2025-12-27T20:14:17.573Z",
    "governor": {
      "name": "Spencer Cox",
      "party": "Republican",
      "terms": [
        "January 4, 2021 - January 8, 2025",
        "January 8, 2025 - Current"
      ],
      "born": "July 11, 1975",
      "birthState": "Utah",
      "school": "Snow College, Utah State University, Washington and Lee University School of Law",
      "spouse": "Abby Cox",
      "contact": {
        "address": "350 N. State Street, Suite 200\nP.O. Box 142220\nSalt Lake City, UT 84114-2220",
        "phone": "801-538-1000"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.utah.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.utah.gov/"
        }
      ],
      "about": [
        "Gov. Spencer J. Cox is a husband, father, farmer, recovering attorney, and Utah’s 18th governor. He also served as the 2023-2024 chairman of the National Governors Association.",
        "Gov. Cox has a long track record of public service, serving as a city councilmember, mayor, county commissioner and state legislator before being appointed as Utah’s lieutenant governor in 2013. He was sworn in as governor on Jan. 4, 2021.",
        "During his first term in office, Gov. Cox cut $1.1 billion in taxes, implemented landmark changes in water law, water conservation and infrastructure planning, locked in record funding for education and teachers, enacted universal school choice and secured funds for affordable housing. A long-time advocate for suicide prevention and mental health resources, he’s become a national voice on protecting youth from the harms of social media. He also signed early education and workforce program funding, launched the One Utah Health Collaborative, and expanded opportunities for women, diverse communities and those living in rural parts of the state.",
        "With a focus on solutions, Gov. Cox promotes respect in politics and innovation in government, works across party lines to find common ground and regularly participates in hands-on service projects. These elements were the foundation of his NGA Chair’s Initiative, “Disagree Better: Healthy Conflict for Better Policy.”",
        "A sixth-generation Utahn, Gov. Cox was born and raised in Fairview, a town of 1,200 in the center of the state. He met First Lady Abby Palmer Cox at age 16 and they married after he returned from serving a two-year mission for The Church of Jesus Christ of Latter-day Saints in Mexico. He attended Snow College, Utah State University and the Washington and Lee University School of Law, then clerked for U.S. District Judge Ted Stewart and worked at a Salt Lake City law firm. Several years later, Gov. Cox and First Lady Cox moved back to Fairview to raise their four children – Gavin, Kaleb, Adam, and Emma Kate – on the family farm. The governor, first lady and Emma Kate currently reside in the Kearns Mansion, also known as the Governor’s Mansion, in Salt Lake City."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2021/01/Governor_Cox_official_square-scaled.jpg",
      "photoLocalPath": "governors/ut-spencer-cox.jpg"
    }
  },
  {
    "state": "Vermont",
    "stateId": "VT",
    "sourceUrl": "https://www.nga.org/governors/vermont/",
    "scrapedAt": "2025-12-27T20:14:19.141Z",
    "governor": {
      "name": "Phil Scott",
      "party": "Republican",
      "terms": [
        "January 5, 2017 - January 9, 2019",
        "January 10, 2019 - January 6, 2021",
        "January 7, 2021 - January 5, 2023",
        "January 5, 2023 - January 9, 2025",
        "January 9, 2025 - Current"
      ],
      "born": "August 4, 1958",
      "birthState": "Vermont",
      "school": "University of Vermont",
      "spouse": "Diana McTeague Scott",
      "contact": {
        "address": "Office of the Governor\n109 State Street, Pavilion\nMontpelier, VT 05609",
        "phone": "802-828-3333"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.vermont.gov/"
        },
        {
          "label": "State Website",
          "url": "http://vermont.gov/"
        }
      ],
      "about": [
        "Phil Scott became the 82nd Governor of Vermont in January 2017 and was reelected to a fourth term in 2022, winning a majority in every city and town in the state. In his 2020 reelection, he earned more votes than any candidate for governor in Vermont history.",
        "As Governor, he is committed to making a difference in the lives of Vermonters by growing the state’s economy, making Vermont more affordable, and protecting the most vulnerable.",
        "Throughout his years of public service, Phil has listened to, and learned from Vermonters, and is always willing to roll up his sleeves to help get the job done.",
        "Phil has consistently focused on economic and affordability issues. During his first two legislative sessions as Governor, he worked with the Legislature to ensure the Fiscal Year 2018 & 2019 General Fund budgets did not raise a single tax or fee, and made critical investments in economic and workforce development, workforce housing, childcare and early learning, career technical training, higher education, clean water, addressing the opioid crisis and more.",
        "Previously, he was elected and served three terms (2011-2017) as Vermont’s 79th Lieutenant Governor. In this role, he launched the Everyday Jobs Initiative – where he worked in 35 different professions around the state – and Vermont Economy Pitch sessions for the opportunity to learn from Vermont’s employers and workers. In 2011, in the wake of Tropical Storm Irene, he organized the removal and disposal of mobile homes around the state, which were destroyed by the flood, all at no cost to homeowners and without spending any taxpayer dollars.",
        "Prior to that role, he was elected to the Vermont Senate for five terms, representing Washington County. During his 10-year service in the Senate, he was Vice Chair of the Transportation Committee and Chair of the Institutions Committee.",
        "Phil is also active in community service projects. In 2005, he founded the Wheels for Warmth program, which allows Vermonters to donate tires they no longer need. The tires that meet state inspection standards are offered for resale at affordable prices, with all proceeds benefiting heating fuel assistance programs. The program has raised more than $428,000 for emergency fuel assistance, sold nearly 19,000 safe donated tires, and recycled more than 31,000 unsafe tires.",
        "For more than thirty years, Phil was a co-owner of his family construction business, and he still races the #14 car at Barre’s Thunder Road, where he has the most career wins as a Late Model driver at the track. He’s also an avid cyclist.",
        "He is a lifelong Vermonter who grew up in Barre and graduated from Spaulding High School and the University of Vermont. He lives in Berlin with his wife Diana McTeague Scott, and has two grown daughters, Erica and Rachael."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/02/Vermont-Phil-Scott-November-2018.jpg",
      "photoLocalPath": "governors/vt-phil-scott.jpg"
    }
  },
  {
    "state": "Virgin Islands",
    "stateId": "VI",
    "sourceUrl": "https://www.nga.org/governors/virgin-islands/",
    "scrapedAt": "2025-12-27T20:14:20.675Z",
    "governor": {
      "name": "Albert Bryan",
      "party": "Democratic",
      "terms": [
        "January 7, 2019 - January 2, 2023",
        "January 2, 2023 - Current"
      ],
      "born": "February 21, 1968",
      "birthState": "Virgin Islands",
      "school": "Wittenberg University, University of the Virgin Islands",
      "spouse": null,
      "contact": {
        "government house": "5047 (21-22) Kongens Gade\nSt. Thomas, VI 00802-6487",
        "phone": "340-774-0001"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.vi.gov/"
        },
        {
          "label": "Territory Website",
          "url": "http://www.gov.vi/"
        }
      ],
      "about": [
        "Albert Bryan Jr. is the ninth-elected governor of the U.S. Virgin Islands. He is an entrepreneur, non-profit executive, and tireless and compassionate advocate for the economic and political advancement of the people of the U.S. Virgin Islands.",
        "During his first term as governor, Bryan, a former commissioner of the Virgin Islands Department of Labor and Chairman of the Virgin Islands Economic Development Authority Board, is boldly leading the U.S. Virgin Islands through unprecedented economic growth and infrastructure expansion. In addition, his administration spearheads a multi-billion-dollar recovery and rebuilding effort to transform the territory’s critical infrastructure in the aftermath of hurricanes Irma and Maria.",
        "In collaboration with the 34th Legislature of the Virgin Islands, Governor Bryan developed and implemented a plan that has placed the Government Employees Retirement System, one of the country’s most underfunded public pension systems, on a path to solvency after more than 30 years of underinvestment. Bryan also boldly and effectively led the U.S. Virgin Islands through the COVID-19 pandemic keeping Virgin Islanders safe while protecting the territory’s tourism-driven economy from collapse.",
        "Bryan continues to make progress on his mission to lead the U.S. Virgin Islands to be number one in tourism, technology, and talent throughout the Eastern Caribbean.",
        "Governor Bryan is the proud father of two daughters, Aliyah and Sumayah."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/gov_bryan_square.jpg",
      "photoLocalPath": "governors/vi-albert-bryan.jpg"
    }
  },
  {
    "state": "Virginia",
    "stateId": "VA",
    "sourceUrl": "https://www.nga.org/governors/virginia/",
    "scrapedAt": "2025-12-27T20:14:22.001Z",
    "governor": {
      "name": "Glenn Youngkin",
      "party": "Republican",
      "terms": [
        "January 15, 2022 - Current"
      ],
      "born": "December 9, 1966",
      "birthState": "Virginia",
      "school": null,
      "spouse": "Suzanne Youngkin",
      "contact": {},
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://www.governor.virginia.gov/"
        },
        {
          "label": "State Website",
          "url": "https://www.virginia.gov/"
        }
      ],
      "about": [
        "Governor Glenn Youngkin is a homegrown Virginian, born and raised in Richmond and Virginia Beach. From washing dishes at a local diner during middle and high school to being named co-CEO of one of the world’s top investment firms, Youngkin knows what it means to work hard and is doing so on behalf of all Virginians.",
        "Since day one, Youngkin has been a champion for educational excellence and parents’ rights. He ushered in historic investments in education, launched lab schools to inject choice and innovation into Virginia’s public schools, funded 18% teacher raises, passed the Virginia Literacy Act to improve literacy among elementary school-age students, renewed focus on career and technical education, transformed Virginia’s school accreditation process, issued Executive Order 33 establishing cell phone-free education statewide, and implemented the All In Virginia tutoring plan to tackle learning loss stemming from extended, forced pandemic school closures by previous state leaders.",
        "As the chief economic development officer of the Commonwealth, Youngkin has facilitated waves of business investment, bolstering job growth and opportunity. Virginia was named by CNBC as America’s Top State for Business in 2024. Under Youngkin’s leadership, Virginia has welcomed over $85 billion in capital commitments from companies moving to Virginia and major expansions from existing Virginia businesses. Since Youngkin took office in 2022, Virginia has seen record job growth, with nearly 250,000 more jobs reported and a record number of Virginians working.",
        "Lowering the cost of living has been a top priority for Youngkin, and he’s delivered $5 billion in tax relief for working families—eliminating the state-level tax on groceries and nearly doubling the standard deduction for all Virginians. Fulfilling his promise to reduce the tax burden on Virginia’s veterans, Youngkin also removed state taxes on military retirement pay up to $40,000.",
        "The Youngkin administration’s unwavering commitment to law enforcement is evident in record additional compensation and funding for training and equipment for public safety heroes. The Governor’s Operation Bold Blue Line has resulted in a 30% decline in homicides, and Virginia is a national leader in combating fentanyl overdoses. In just 45 days, Operation FREE Virginia reported 19,000 pounds of narcotics seized, including 550 pounds of fentanyl, over 1,000 arrests, and nearly 270 firearms confiscated. With leadership from First Lady Suzanne Youngkin’s It Only Takes One fentanyl awareness campaign, Virginia has seen a 23% decline in year-to-year overdoses—the third-highest reduction in the nation.",
        "Youngkin has put business practices to work, making government run more efficiently and effectively—slashing Department of Motor Vehicle (DMV) wait times, reducing Virginia’s regulatory burdens, streamlining permitting processes, creating universal licensing for 85 occupations in the Commonwealth, and eliminating the backlog of more than 1 million COVID-related unemployment claims while investigating and prosecuting fraud and abuse. In addition, during his administration’s first three fiscal years, the Youngkin administration saved $4.3 billion of appropriated but unspent taxpayer funds.",
        "In response to Virginia’s behavioral health crisis, Youngkin launched Right Help, Right Now to transform the overwhelmed behavioral health system by expanding capacity and real-time access to help Virginians pre-crisis, in-crisis, and post-crisis. The Youngkin administration worked tirelessly to overhaul the state’s childcare and early education system with the Building Blocks for Virginia Families Initiative, while revamping Virginia’s foster care system and dedicating unprecedented resources to support access to developmental disability (DD) waivers.",
        "Youngkin embraced innovation and common sense when he launched Virginia’s “All-American, All-of-the-Above” energy and power plan to deliver reliable, affordable, and increasingly clean power by promoting natural gas and nuclear power as essential components of Virginia’s energy future. With a commitment to conservation, the Governor has championed agriculture best management practices and support for clean rivers, streams, and the Chesapeake Bay.",
        "Youngkin attended college at Rice University on a basketball scholarship. He graduated with a degree in mechanical engineering and a degree in management studies. He later earned an MBA from Harvard Business School, where he was a Baker Scholar. Youngkin’s business career included 25 years at The Carlyle Group, where he stepped down as co-CEO to run for governor.",
        "The Governor has been married for over 30 years to Suzanne Youngkin, a devoted leader in nonprofits and charitable causes. Together, they are dedicated to their four wonderful children. Their family journey has been and continues to be guided by faith, walking hand in hand as humble followers of Christ."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2022/01/Governor-Glenn-Youngkin-Official-photo2022.jpg",
      "photoLocalPath": "governors/va-glenn-youngkin.jpg"
    }
  },
  {
    "state": "Washington",
    "stateId": "WA",
    "sourceUrl": "https://www.nga.org/governors/washington/",
    "scrapedAt": "2025-12-27T20:14:23.491Z",
    "governor": {
      "name": "Bob Ferguson",
      "party": "Democrat",
      "terms": [
        "January 15, 2025 - Current"
      ],
      "born": "February 23, 1965",
      "birthState": "Washington",
      "school": "University of Washington (BA); New York University (JD)",
      "spouse": "Colleen Ferguson",
      "contact": {
        "address": "PO Box 40002\nOlympia, WA 98504-0002",
        "phone": "360-902-4111"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://www.governor.wa.gov/"
        },
        {
          "label": "State Website",
          "url": "http://access.wa.gov/"
        }
      ],
      "about": [
        "Bob Ferguson is a fourth-generation Washingtonian and son of a public school teacher and Boeing employee. Bob has lived and worked on both sides of the mountains, starting his legal career in Spokane. He’s been standing up to powerful interests that don’t play by the rules and achieving big victories for Washington families.",
        "Bob is fighting to make state government more efficient and effective and center the people in every decision. He’s focused on speeding up government and solving problems. His priorities include making housing more affordable, improving public safety, strengthening education, and reducing costs for Washington families. He’s proposed reforms to address the ferries crisis, increase well-trained law enforcement, and adopt universal free school lunches for all Washington K-12 students. He will protect Washingtonians’ core freedoms, including the right to access reproductive health care.",
        "Bob’s family homesteaded in the 19th century on the beautiful Skagit River, which may explain why Bob is such an enthusiastic mountain climber and backpacker. Bob has hiked hundreds of miles of Washington trails and climbed many of the state’s highest peaks. Bob is an internationally rated chess master. He has twice won the Washington State Chess Championship. Bob lives with his wife Colleen, a longtime educator, and their twins, Jack and Katie."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Bob_Ferguson.jpg",
      "photoLocalPath": "governors/wa-bob-ferguson.jpg"
    }
  },
  {
    "state": "West Virginia",
    "stateId": "WV",
    "sourceUrl": "https://www.nga.org/governors/west-virginia/",
    "scrapedAt": "2025-12-27T20:14:24.724Z",
    "governor": {
      "name": "Patrick Morrisey",
      "party": "Republican",
      "terms": [
        "January 13, 2025 - Current"
      ],
      "born": "December 21, 1967",
      "birthState": "New York",
      "school": "Rutgers University (BA); Rutgers University, Newark (JD)",
      "spouse": "Denise Henry Morrisey",
      "contact": {
        "address": "1900 Kanawha Street\nCharleston, WV 25305",
        "phone": "304-558-2000"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://governor.wv.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.wv.gov/"
        }
      ],
      "about": [
        "Patrick James Morrisey is the 37th governor of West Virginia. Morrisey took office on January 13, 2025. He campaigned across all 55 counties during his bid for governor, running to make West Virginia once again the shining state in the mountains.",
        "Before being elected governor, Morrisey served as West Virginia’s Attorney General since 2012. As Attorney General, Morrisey delivered some of the nation’s most significant legal victories to defend West Virginia. He prevailed in West Virginia v. EPA, which has been declared one of the most pivotal U.S. Supreme Court wins in decades.",
        "Morrisey championed major legal wins protecting West Virginians’ constitutional rights, delivering record-setting settlements against drug companies, and preserving the West Virginia way of life.  Morrisey has also fought to protect the unborn, preserve Second Amendment rights, and defend girls’ sports.",
        "During his time in public service, Morrisey served as a former Chairman of the Republican Attorney Generals Association, a former Chief Counsel to the House of Representatives Energy and Commerce Committee, and an owner of his own law practice. Prior to public office, Morrisey had a distinguished legal career as a former Partner and Practice Chair at a major national law firm. Morrisey is also a former professional Tennis Umpire, and even worked the finals of the U.S. Open.",
        "Morrisey is the son of a World War II veteran and a VA registered nurse. He went on to put himself through Rutgers College and Rutgers School of Law by working multiple jobs while balancing academics and athletics.",
        "Morrisey is married to his wife and First Lady, Denise, and they have one daughter, Julia. He moved to Harpers Ferry in 2006."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2025/01/Patrick-Morrisey-scaled-1.jpg",
      "photoLocalPath": "governors/wv-patrick-morrisey.jpg"
    }
  },
  {
    "state": "Wisconsin",
    "stateId": "WI",
    "sourceUrl": "https://www.nga.org/governors/wisconsin/",
    "scrapedAt": "2025-12-27T20:14:26.247Z",
    "governor": {
      "name": "Tony Evers",
      "party": "Democratic",
      "terms": [
        "January 7, 2019 - January 3, 2023",
        "January 3, 2023 - Current"
      ],
      "born": "November 5, 1951",
      "birthState": "Wisconsin",
      "school": "University of Wisconsin-Madison",
      "spouse": "Kathy Evers",
      "contact": {
        "address": "P.O. Box 7863\nMadison, WI 53707",
        "phone": "608-266-1212"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "https://evers.wi.gov/"
        },
        {
          "label": "State Website",
          "url": "http://www.wisconsin.gov/"
        }
      ],
      "about": [
        "On November 6, 2018, the people of Wisconsin voted Tony Evers the 46th governor of Wisconsin. Four years later, on November 8, 2022, Wisconsinites re-elected Tony Evers as governor.",
        "Prior to his election in 2018, Governor Evers served as the Wisconsin State Superintendent of Public Instruction, winning statewide elections in 2009, 2013, and 2017.",
        "With over three decades of public education experience, Governor Evers has spent most of his life fighting for Wisconsin’s kids. He began his career in education first as a science teacher in Baraboo before going on to serve families, students, and communities across the state, including in Tomah, Oakfield, Verona, and Oshkosh.",
        "As governor, Governor Evers has continued his work championing public education at every level and advocating for investing in the state’s public education system, believing, as he often says, that doing “what’s best for our kids is what’s best for our state.”",
        "Governor Evers and the Evers administration have accomplished a great deal since taking office in 2019. From historic investments in education to supporting farmers and small businesses, signing one of the largest tax cuts in state history, advocating for access to clean and safe drinking water, reducing stigma for mental and behavioral health, expanding access to affordable healthcare, housing, and child care, and preparing our state for the 21st Century by expanding high-speed, affordable internet and fixing our roads and infrastructure, Governor Evers leads by always trying to do the right thing for Wisconsin.​",
        "Born and raised in Plymouth, Wisconsin, Governor Evers graduated from Plymouth High School and earned his bachelor’s, master’s, and doctoral degrees in educational administration from the University of Wisconsin-Madison. He is married to his high school sweetheart, Kathy, also a former educator. Governor Evers and Kathy are parents of three adult children, all public school graduates, and have nine grandchildren."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/09/Wisconsin-Tony-Evers-January-2019.jpg",
      "photoLocalPath": "governors/wi-tony-evers.jpg"
    }
  },
  {
    "state": "Wyoming",
    "stateId": "WY",
    "sourceUrl": "https://www.nga.org/governors/wyoming/",
    "scrapedAt": "2025-12-27T20:14:27.968Z",
    "governor": {
      "name": "Mark Gordon",
      "party": "Republican",
      "terms": [
        "January 7, 2019 - January 2, 2023",
        "January 2, 2023 - Current"
      ],
      "born": "March 14, 1957",
      "birthState": "New York",
      "school": "Middlebury College",
      "spouse": "Jennie Gordon",
      "contact": {
        "address": "State Capitol Building Room 124 Cheyenne, WY 82002",
        "phone": "307/777-7434"
      },
      "links": [
        {
          "label": "Governor's Website",
          "url": "http://governor.wy.gov/"
        },
        {
          "label": "State Website",
          "url": "http://wyoming.gov/"
        }
      ],
      "about": [
        "Mark Gordon grew up on the family ranch in Kaycee, Wyoming, where he learned the values of hard work, integrity, and the importance of working together. As Governor, he brings those values to the table, maintaining his commitment to a Wyoming where her citizens can pursue their dreams while the state retains her unique character. He strongly believes that Wyoming must chart its own course and is a steadfast defender of its interests to do so.",
        "As a conservative, Governor Gordon has worked tirelessly to set Wyoming on a sustainable fiscal path. He is committed to making government more transparent, accessible, productive, and efficient. He believes government is best when it is closest to the people and is committed to giving local communities the tools they need to thrive. He is a staunch advocate of quality education in all modes, public and private, and for all children.",
        "Governor Gordon served as Wyoming State Treasurer from October 2012 until January 2019, when he was sworn in as Governor. During his time in office, he was ranked in the top 100 “most significant and impactful public investor executives.” In addition, under his guidance, Wyoming’s sovereign funds earned a No.1 ranking for the United States and No.3 in the world for transparency by the Peterson Institute.",
        "First elected Governor in 2018, he successfully led Wyoming through some historically difficult times. Consistently rated as one of the top ten governors in the country, he has spearheaded efforts to diversify Wyoming’s economy from technology and finance to agriculture, energy, research, and tourism. He and his wife, Jennie, are dedicated to making Wyoming the best place to raise a family.",
        "Shortly after becoming First Lady, Jennie called on her upbringing and management acumen as a rancher and mother to establish the Wyoming Hunger Initiative, which has meant so much for many in Wyoming suffering from food insecurity.",
        "Governor Gordon and Jennie have four grown children – Aaron; Anne; Bea with husband Austen and their son Crawford and daughter Anntonia; and Spencer with wife Sarah, their son Everett, and twin daughters Violet and Eloise."
      ],
      "photoUrl": "https://www.nga.org/wp-content/uploads/2019/01/Wyoming-Mark-Gordon-November-2019.jpg",
      "photoLocalPath": "governors/wy-mark-gordon.jpg"
    }
  }
]